# 1.0市场原理

## 1.1交易误区

> 大部分的误区：他们看到的是图表，感知的是价格走势以及由此产生的技术分析模式和基于指标的信号。 他们认为这就是现实。这就是他们所知道的一切。大多数书籍、网站和课程都是这么教的
>
> 
>
> 下图，大多数人只关注价格。他们观察到看跌突破是由于价格跌破 了一段横盘整理期，或短期头肩顶形态（用 S-H-S 标记）
>
> 如果他们是以形态交易者，他们会在突破头肩形颈线（B 点）或首次确认收盘价 低于颈线（C 点）时做空
>
> 基于指标的交易者也可能在 C 点附近进场，因为他们的信号通常是基于价格的滞后导数， 在新方向发生重大变动之前不会触发进场

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407021223053.png)

> 这些交易者面临的问题是他们关注的是价格。
>
> 价格变动就是结果。
>
> 虽然您还没有看到，但在这个例子中，如果能识别出原因，您就可以在 A 点附近进场，并 预期如果价格突破 B 点区域和稍低的支撑位，走势就会明朗，直到 D 点和 E 点附近的可 能目标区域

## 1.2市场本质

> 1.什么是价格
>
> 2.价格如何变动
>
> 3.什么是市场

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407022225507.png)

### 1.2.1什么是价格

> 买方希望以这个价格购买。.卖方也想以这个价格卖出。他们走到一起，成交
>
> ==价格视为双方做出的买卖决定==
>
> 从交易的角度来看，价格是两个交易者做出的买卖决定

### 1.2.2价格如何变动

> 价格走势是供求关系的函数
>
> 供给是卖方希望以特定价格出售的产品数量。
>
> 需求是买方希望以特定价格购买的产品数量。
>
> 价格会随着供应和/或需求的变化而变化。

#### 1.2.2.1房屋拍卖理论

> 首先，我们来看一个大多数人都熟悉的例子--房屋拍卖。在这种情况下，我们有**固定的供应量--一栋待售房屋**。而需求量是可变的，这取决于公众对价值的看法。在经济增长强劲 的时期，如果一幢地段极佳的好房子可能会有大批潜在买家争相购买。而对于价格过高的 房子，在市场下滑时，可能只有少数潜在买家，甚至可能一个买家都没有。
>
> 在这个例子中，我们假设有一大群买家，他们都迫切希望获得该房产的所有权，都愿意以 介于 65 万至 75 万美元之间的不同价格购买。房地产经纪人以 55 万美元的价格开始拍卖 。接下来，竞拍者们将以不断提高的价格相互竞争，希望在拍卖过程结束时成为最后一个 。最初的价格会迅速上涨，57.5 万美元--60 万美元--62 万美元--64 万美元--65 万美元 -- 66万美元.当超过每个投标人的最高价格时，他们将退出竞争。价格上涨的速度可 能会放缓，竞拍者通常会花更多时间考虑下一步行动。如果竞拍者在购买时有足够的情绪 ，他们甚至会超过事先计划好的最高价，以确保没有其他人得到他们的房产。不顾一切地确保没有其他人得到他们的财产。 750,000 美元 - 752,000 美元 752,500 美元 - 753,500 美元。最终，将没有愿意支付更高价格的竞标者，该房产将被出售给出价最高的竞标者。
>
> 在这个例子中，需求由多个买家组成，他们都想要购买并愿意支付更高的价格。供应由单一卖家组成，愿意让价格上涨，直到没有更多买家。
>
> ==需求压倒了供应，导致价格上涨。价格继续反弹，直到没有更多的买家愿意支付更高的价格==

> 现在，让我们考虑一个假设的例子：有两个急于出售房产的卖家，要出售两套基本相同的 房产。比方说，两套并排的公寓，有相似的质量和固定装置，相似的景观；价值基本相同 。假设只有一个买家有兴趣购买一套房产。现在的流程与前一个例子相反。 买方有能力坚持，而两个卖方则需要竞争。卖方会轮流降低要价，直到达到一方不愿再降 价的程度。假设买方可以接受这个价格，交易就可以达成。
>
> ==供不应求。价格下跌，直到没有人愿意以更低的价格出售。==
>
> ==重要的一点是......最重要的不仅仅是参与者的数量，而是他们寻求交易的迫切程度。==
>
>
> 考虑一下最初的房屋拍卖，买家再次愿意支付最高 75 万美元的不同金额，但这一次业主对房产的要价过高。拍卖师起价85万美元。在这种情况下，将不会有投标。尽管有多个潜在买家和一名卖家，但不会发生任何交易。交易发生的唯一方式是，如果一个或多个买家决定他们绝对必须拥有该房产，并且愿意通过将出价提高到预先计划的最高限额以上来支付更高的价格，或者卖家愿意降低开盘要价以试图找到买家。
>
> 让我们假设卖方急于出售该房产。拍卖师将被指示逐步降低要价，直到找到买家并可以进行销售。
>
> 在这种情况下，尽管只有一个卖家，但该卖家的绝望程度大于买家的绝望程度，导致价格下跌。
>
> 供应超过需求，价格下跌。

#### 1.2.2.2双重拍卖流程

> 在交易中，我们现在有所谓的双重拍卖流程。多个买家竞相买入市场，多个卖家竞相卖出市场，全部同时进行。
>
> 首先查看出价栏，我们可以看到有 2 份合约希望以 1.4786 买入，4 份合约希望以 1.4785 买入，3 份合约希望以 1.4784 买入，依此类推，直至 15 份合约1.4782。更进一步，但是这里的 DOM 屏幕仅显示 5 层深度。请注意，这些出价数量中的每一个不一定只是一个交易商。 1.4782 的 15 份合约出价可能来自一名交易者，但同样可能来自多个交易者，例如，5 名交易者每人出价 1 份合约，2 名交易者每人出价 5 份合约，总共有 15 份合约以此价格出价。
>
> 在卖价方面，我们有 3 份合约以 1.4787 的价格出售，5 份合约以 1.4788 的价格出售，依此类推，直至 5 份合约以 1.4791 的价格出售。
>
> ==因此，左侧的出价栏显示了当前的需求，或者我有时所说的看涨压力。==
>
> ==右侧的卖出栏显示当前供应，或者我有时将其称为“看跌压力”。==
>
> 有人想以 1.4786 买入，但其他人想以 1.4787 卖出。
>
> 可以发生交易吗？不会。交易发生的唯一方式是其中一位买家愿意提高价格并接受当前的要价，或者其中一位卖家愿意降低价格并接受当前的出价。
>
> 或者，当前不在这些队列中等待的其他交易者决定以任何价格进入或退出市场，因此使用市价订单，该订单将自动以当前要价购买或以当前出价出售价格。
>
> 让我们假设买家比卖家更绝望，因此他们愿意支付更高的价格。
>
> 买家迫切希望进入这个市场，因此他们会提高出价并接受要价。最后的销售价格保持在 1.4787，直到该水平的所有三份合约均被买入。此时，由于 1.4787 处没有剩余合约，买家将不得不在 1.4788 处买入。最后成交价上涨至1.4788。其他买家看到价格上涨，也会在绝望中提高出价，或者干脆通过市价订单购买，接受他们能得到的任何要价。他们觉得自己必须进入这个市场。一旦以 1.4788 的价格买入 5 份合约，买家就必须愿意支付 1.4789，这将成为新的最后销售价格。每个级别的供应都将被吸收，买家将被迫出价越来越高，才能完成交易。上次销售价格继续上涨。一些卖家会观察到价格的上涨，并从市场上撤回卖单，以更高的价格取而代之。随着越来越多的买家愿意以更高的价格购买，价格将继续上涨。
>
> 在某个时候，购买需求将会结束。价格将上涨到买家不再愿意支付更高价格的程度，或者直到更高的价格吸引更多卖家，增加“卖出”栏中的可用数量，数量足以吸收所有看涨压力。集会将会停止。一些之前购买的交易商现在可能会提供出售合约，以获取利润并结束交易，从而有效地增加供应或看跌压力。
>
> 然而，如果没有进一步购买，卖家将被迫降低价格才能进行交易。他们会降低要价，使其与买入价相匹配。最后的销售价格现在将下降。看到最后的交易价格下跌，其他卖家就会效仿并降低价格，或者干脆通过市价订单出售，接受他们能得到的任何出价。绝望情绪将从买方转移到卖方。每个价格水平的出价都会被吸收，因此卖家将被迫进一步降价。一些潜在买家会看到价格下跌，并会撤回出价并以更低的价格取而代之。
>
> 价格将继续下跌，直到我们的供应耗尽。要么潜在卖家不再愿意以如此低的价格出售，要么较低的价格将吸引足够的新买家进入市场，以吸收所有供应。价格下跌将停止。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031109121.png)

#### 1.2.2.3总结

> ==价格走势是所有交易者看涨或看跌情绪及其在市场中行动（买入或卖出）决定的集 体结果。==
>
> 
>
> ==从供给/需求的角度来看，这就是市场的运作方式。这是一个双重拍卖过程，拍卖价格的上下浮动取决于当时的主导力量——需求或供给。==
>
> ==当需求大于供应并且买家愿意支付更高的价格时，价格就会上涨。==
>
> ==价格会上涨，直到买家消失，或者供应量增加到足以吸收所有需求为止。==
>
> ==当供应大于需求且卖家愿意以较低价格出售时，价格就会下跌。==
>
> 价格走势是供求关系的函数。
>
> ==或者更正确地说......价格变动是供需失衡的结果。而供需失衡是由交易者的交易紧迫感造成 的。==

> 单个价格条是在该价格条的时间范围内运行的双重拍卖过程的结果。
>
> 每次价格波动都是在该价格波动期间运行的双重拍卖流程的结果。在一段时间内，当需求持续大于供给时，价格将上涨，如波动 1 和 3 中的情况。当供给持续大于需求时，价格将下跌，如波动 2 中的情况。
>
> 缺口：请注意标记为 A 的蜡烛图开始时的缺口。这发生在两个 与英镑相关的新闻事件--申请人数量变化和平均收入指数--发布之 时。对该新闻的看涨反应意味着所有供应都从市场中撤出，因此想 要参与市场的看涨者需要寻求更高的价格来找到一个 卖方。有人愿意卖出的第一个价格变成了新闻后第一根蜡烛的开盘 价，在图表上留下了大约 10 个点的缺口。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031126096.png)

> 任何时候个体交易者的情绪可能是看涨或看跌。然而，当考虑到市场内所有交易者的操作时，净效应将是净看涨、看跌或中性情绪。
>
> ==看涨情绪导致看涨订单流，从而导致价格上涨，如波动 1 和 3 所示。==
>
> ==看跌情绪导致看跌订单流，导致价格下跌，如波动 2 所示。==
>
> ==中性情绪导致价格窄幅震荡。==
>
> 随着单个交易者越来越看涨，他们会增加集体买家的看涨情绪。如果有足够多的人这样做 ，整个市场的整体情绪就会变得看涨，供不应求，价格就会上涨。
>
> 随着单个交易者越来越看跌，他们会加剧集体卖家的看跌情绪。如果有足够多的人这样做 ，整个市场的整体情绪就会变得看跌，供大于求，价格就会下跌。
>
> ==价格随着供求关系的变化而变化。==
>
> ==供求关系会随着群众情绪的变化而变化。==
>
> ==而群众的情绪会随着市场参与者看涨或看跌情绪的变化而变化。==
>
> 正如我们发现价格是两个人做出的买入和卖出决定一样，我们现在已经确定，价格的变动 也是所有市场参与者做出个人交易决定的净效应的结果
>
> 供需失衡导致价格波动 
>
> 随着市场参与者情绪的变化，供求关系也会发生变化。 
>
> 因此，价格取决于市场参与者的看涨或看跌情绪。 
>
> 所有单个交易员的决定和行动的净总和构成净订单流。 
>
> 当净订单流看涨时（需求大于供给），价格就会上涨。 
>
> 价格持续上升，直到高价位的买家用完，或者直到高价位吸引了足够数量的卖家 来满足需求。 
>
> 当净订单流看跌（供大于求）时，价格就会下跌。 价格持续下跌，直到低价的卖家用完，或者直到低价吸引了足够数量的买家来克服 供应

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031140981.png)

## 1.3什么是市场

> 交易者做出交易决定，从而产生净订单流，进而产生效果--价格变动
>
> 我们将市场视为一个交易者集体，所有交易者都根据自己的看涨或看跌情绪做出交易决策 并采取行动。这导致了看涨或看跌的净订单流，从而产生了效果--价格变动。
>
> 市场是交易者做出的交易决策。市场不是价格变动的结果
>
> 当我们看图表时，不要将其视为价格变动。把它看成是交易者做出的买入、卖出或袖手 旁观的决定。 
>
> 你需要看到他们的痛苦。你需要看到他们何时感到贪婪。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031142595.png)

### 1.3.1案例1

> 下图，不要只看到 A 点支撑位下方的突破
>
> ==学习从其他交易者的角度看待所有价格走势，以及价格走势如何影响他们的决策。==
>
> 看到空头带着预期和贪婪进入 A 点，带着他们的卖单，预计突破后价格会更低。
>
> 看到在 B 点买入的多头期望能守住支撑。这些人很恐慌——他们正在浮亏--市场正在快速向不利于他们的方向发展。那些没有被惊呆的多头将启动止损，增加看跌压力，迫使价格进一步走低。
>
> 交易者，做出交易决策。
>
> 当价格停滞在 C 点时，不要只看到波动低点。看到的是抓住突破时机的短线交易者回补仓 位获利了结。这增加了看涨压力，并减缓了突破走势。还可以看到一些新的多头决定做多，希望抓住突破失败的机会。这些交易者的决定以及由此产生的买单足以使供需方程向看涨方向斜，从而导致回撤。
>
> 不要只看到 D 点的突破回调。
>
> 那些错过了最初突破的交易者热情地抛售，因为价格给了他们第二次做空的机会，或者那些抓住了最初突破的交易者决定增加头寸。这两种情况都增加了看跌压力。
>
> 看到从 B 点做多的交易者在经历了 C 点的下跌之后，由于回调为他们提供了在接近入场点的位置卖出以减少损失的机会，因此热情地抛售。再次加剧看跌压力。
>
> 更精明的短期交易者在 C 处买入多头，预期头皮会回到突破点，并通过卖单获利了结，进一步增加了看跌压力。
>
> 然后，当这种看跌压力导致价格从 D 点再次下跌时，看到那些在 C 点买入的多头预期突破失败并长期反转回到新高，不得不惊慌地卖出，因为他们意识到突破失败确实造成了损失。没有发生，他们就陷入了失败的境地。
>
> 所有这些交易决策都会导致看跌情绪、看跌压力、看跌净订单流，从而导致价格下跌。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031145293.png)

### 1.3.2案例2

> 不要看到下图，就看到趋势市场在 A 点出现回调。
>
> 学习从其他交易者的角度看待所有价格变动，以及价格变动如何影响他们的决策。
>
> 大量交易者都有试图对抗趋势的自然倾向。这些人会寻找任何机会做多，希望能抓住逆转。
>
> 看到这些满怀希望的多头带着预期和贪婪进入 B 附近，他们带着买单，期待更高的价格，并有机会向他们的朋友吹嘘他们如何抓住反转。他们的看涨订单流，加上那些在新低点获利了结的空头的压力（也是买入订单），足以克服价格下行走势并开始回调。
>
> 当价格到达 A 点区域时，您可以看到在 B 点买入的多头内部的恐惧程度上升，因为三根k线的价格停滞不前。
>
> 更精明的交易者会顺应趋势进行交易，并利用回调至 A 点作为做空机会，制造看跌压力，反对短期回调。
>
> 他们看到，随着市场回落，恐慌在 C 点开始，B 点的多头纷纷平仓，一些更聪明的多头在盈亏平衡点出局，但大多数人都亏损，因为他们难以置信地看着市场打掉他们的止损点。事实证明，它们的反转只是趋势中的回调。
>
> 

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407031955307.png)

## 1.4总结

> 市场的现实是交易者做出交易决策。
>
> 个人交易者根据他们对市场的看法做出交易决定。
>
> 市场中所有交易者的净效应将导致净看涨、看跌或中性情绪，从而导致看涨、看跌或中性 订单流及其相应的价格波动。
>
> ==学习从其他交易者的角度看待所有价格走势，以及价格走势如何影响他们的决策。==
>
> 当我们看图表时，不要把它看作是价格变动。要把它看成是交易者在恐惧和贪婪的基础上 进行的操作，以及影响其决策和后续行动的所有感知限制、启发式思维和偏见。

# 2.0交易现实

## 2.1我们如何获利

> 假设我们交易的目的是从市场中获利。
>
> 对我们大多数人来说（一些期权交易者除外），利润来自于捕捉价格走势。在图 2.12 中 ，这可能是通过在趋势回调时在 A 点买入，并在 B 点的过度扩张高点卖出；也可能是通 过在下降趋势回调时在 C 点卖空，并在 D 点的滞涨期平仓获利。
>
> 利润来自于价格的变动，以及你低买高卖或高卖低买的能力。
>
> 但有一点很重要。获利需要在进入点之后的价格变动。
>
> 让我们从其他交易者的角度以及我们对市场性质和价格走势的新认识来考虑这个问题。
>
> 考虑多头头寸。为了获利，必须在入场点后出现看涨的价格走势。看涨的价格走势来自看涨的订单流，而看涨的订单流则来自净看涨情绪--交易者做出买入决定。因此，要想获利，其他交易者必须在您做出买入决定的同时和之后做出买入决定。
>
> 空头头寸的概念相同。为了获利，必须在进入点之后出现看跌的价格走势。看跌的价格走势来自看跌订单流，而看跌订单流则来自净看跌情绪--交易者做出卖出决定。因此，要想 获利，其他交易者必须在您做出卖出决定的同时和之后做出卖出决定。
>
> 如果没有持续的订单流支持您的决定，并且在您做出决定之后，价格就无法朝着对您有利的方向发展，您将无法获利。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407032344030.png)

## 2.2盈利分析

> 利润的真正基础
>
> 分析目标必须如下：
>
> 在你知道其他人会在你之后买入的区域买入，因为他们的买入会产生净订单流或看 涨压力，从而推动价格上涨，让你有机会获利
>
> 在你知道别人会跟在你后面卖出的地方卖出，因为他们的卖出会产生净订单流或看 跌压力，从而推动价格走低，让你有机会获利。
>
> 在别人会跟着你买的地方买，在别人会跟着你卖的地方卖。
>
> 为此，您的分析必须侧重于交易员决策的领域。 其他交易者在想什么？他们会在哪里做出交易决定？找出别人会做出购买决定 的区域，你就能从中获利。确定他人将做出销售决定的领域，你就能从中获利。
>
> ==最有效的分析不是对价格的分析，而是对交易者决策的分析。==
>
> ==个体交易者的决定是未知的。==
>
> 从这句话中我们可以得出结论，任何时候的集体情绪也应该是未知的。
>
> 虽然一般情况下确实如此，但请记住，供求失衡实际上并不意味着一方的人数更多，而是 绝望或紧迫感的失衡。 
>
> 通过分析，我们可以确定在哪些领域，重要的交易商群体将面临极大的压力，从而被迫以 合理可预测的方式采取行动。 
>
> 在压力下，人类的决策和行动会变得更容易预测，而且通常会更加绝望和紧迫。这正是我 们所追求的品质。 这一点不能保证，但一般来说相当可靠。
>
> 考虑一下人的本性，尤其是在其他紧张时刻的人群行为。想象一下购物中心。购物中心内 任何个人的行动在很大程度上都是不可预测的。从整体上看，所有购物者的行动基本上都 是随机的。 
>
> 这与他们在火警警报响起时的行动形成鲜明对比。现在，他们的行动更容易预测，因为所 有购物者都会朝着最近的出口方向移动（希望是有序的）。
>
> ==交易者何时压力最大==
> 当市场走向对某个人的仓位不利，并且他们处于亏损状态时。在某个时刻，他们将达到最大压力，此时他们最终会承认自己错了，并退出自己的立场。
>
> 当市场走向对获利的头寸不利时。在某个时刻，他们将达到最大压力，此时他们将接受自己的交易不再正确，并在市场收回其剩余利润之前退出头寸。
>
> 换句话说，当他们发现自己错了，被迫采取行动（以尽量减少损失或尽量减少利润的进一 步减少）时。
>
> ==我们的目标是在最大压力点之前或之时入场，在这个点上，交易者开始接受他们是错的。==
>
> 他们决定退出是一种缓解压力的手段。这就产生了订单流，使我们的头寸获利（当然，前 提是您必须妥善管理交易）。

## 2.3有效与无效的交易系统

> 有效的交易策略是基于对市场供求力量的分析，以及对这将如何影响其他交易者决策的评 估。
>
> 了解了价格变动的方式和原因，我们就能确定图表上的一些区域，如果价格向这些区域移 动，大量交易者就会陷入紧张状态，被迫采取行动。由此产生的订单流将导致价格波动。 
>
> 通过有效的分析，我们可以确定潜在的高概率设置区域，如果错误，风险较低，如果正确 ，回报较高。 
>
> 有效的分析可以让我们积极管理交易--当价格走势证实其他交易者的反应与我们的预期一 致时，我们可以持有交易；当价格走势与我们的预期不符时，我们可以在止损前退出。 
>
> 通过有效的分析，我们可以管理我们的价格目标，在图表上确定反对订单流将进入市场的 区域，从而限制任何进一步获利的机会。

#### 2.4有效的分析

> 下图显示了有效分析。
>
> 在价格条 A 上，价格跌破了支撑位 B。突破交易者和那些根据 指标持续信号操作的交易者很可能会在价格下跌时进场，但有效的分析可以识别出这一走 势是在 C 附近的支撑区域内，而且是在更大的时间框架上升趋势背景下发生的。进入支撑位的较低价格可能会带来看涨订单流，从而反对突破。我们估计，如果 突破失败，这些突破交易者将被迫退出，从而导致看涨订单流激增。我们的进场触发点在  D，止损点在 A 下方，最初的部分目标点位在 E，我们预计部分多头会在此获利了结，从 而减缓或停止上涨速度。部分利润将在此获利了结，其余利润将瞄准下一价位 F
>
> 我们的目标是，在导致这一走势的前提仍然存在时持有头寸，直到价格到达我们知道交易 者会做出相反决定的图表区域，形成一股可能会限制价格进一步波动的对立力量。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407040014817.png)

> 让我们回顾一下我的整个策略--有效的交易策略--所依据的关键原则或信念：
>
> 单笔交易的利润来自于在潜在的方向性价格变动出现之前就能识别出来，并根据这 一信念采取行动。因此，盈利需要价格变动。 
>
> 价格变动代表着供求关系的变化。只要供不应求，价格就会上涨。每当供大于求 ，价格就会下跌。
>
> 随着市场参与者情绪的变化，供求关系也会发生变化。 
>
> 因此，价格走势取决于市场参与者的看涨或看跌情绪。 
>
> 价格走势是由人的决策决定的。虽然交易者个人的决策通常无法预测，因为我们无 法知道影响个人决策潜力的因素和限制，但在极端压力下，情况就不一定如此了。 
>
> 人在压力下的行为在某种程度上是可以预测的（以概率为基础，而非确定性）， 尤其是当我们的分析被证明是不准确的，而我们又处于亏损的交易中时。在某些时 候，我们不得不退出，以减少痛苦。 
>
> 因此，通过确定有足够多的交易者会承受压力的时间，我们就能确定潜在的高概率 设置区域。 
>
> 因为你不可能在 100%的交易中获胜，成功必须来自于一系列的交易，从获胜中减 去亏损和费用后才能获利。 
>
> 只有在策略中包含优势的情况下，才能在一系列交易中持续获利：
>
> 分析技巧足以识别交易者处于压力之下的这些区域，从而提供更高的设置概 率。 
>
> 交易者的注意力、纪律、信心和心理都得到充分发展，能够识别这些设置区 域内的低风险入口，并采取适当行动进入交易。 
>
> 我们对仓位大小和风险管理进行了明确规划，以便在这笔交易成为众多亏损 交易之一（无论是由于我们的分析错误，还是由于市场情绪发生变化）时， 最大限度地减少对股票余额的损害。 
>
> 交易者有足够的经验来管理交易，以便将损失降到最低，将收益最大化。 
>
> 有可能开发出一种能识别更高概率设置的策略。我们将在以后的章节中讨论这个 问题。 
>
> 可以学习适当的头寸大小和风险管理。 我们可以在市场中积累经验，提高交易管理和退出的效率，但由于市场的不确定 性，我们永远无法掌握这一领域。 
>
> 我们有可能掌握自己的交易心理，从而将恐惧对我们按计划流程和常规进行交易的 影响降到最低。
>
> 因此，从市场中获利是可能的

# 3.0市场分析

## 3.1市场分析的目的

> 通过市场分析，我们正在培养态势感知能力，并保持专注。 
>
> 了解价格曾经的走势，评估当前价格走势的强弱，并判断未来价格可能的走向。
>
> 价格去哪儿了？ 价格可能走向何方？
>
> 交易者的决策无法用固定的规则来定义，因此价格走势也无法用固定的规则来定义。
>
> 试图用固定而客观的规则来定义市场，其结果只能是一种近似值，在关键时刻无法代 表现实。

## 3.2过往的市场分析

### 3.2.1支撑与阻力

> S/R 是为价格进一步波动提供障碍的区域。在大多数情况下，这将显示为市场的转折点（波段高点和低点）。
>
> S/R 是交易者做出决策的区域。不同的交易者会在不同的价格做出决定，并在该区域内 的不同时间执行决定。
>
> 因此，在分析过程中，即使您的图表可能只用一条线显示 S/R，您也必须始终关注整个区 域。请注意，价格可能在该线之前转向；突破该线并不一定构成突破 S/R 水平
>
> S/R 是价格图表上形成价格运动障碍的区域。支撑位起着下限的作用，限制价格进一步向下运动。阻力则是上限，限制价格进一步向上运动。
>
> 价格变动是供求关系的函数
>
> 价格因净看涨情绪而上涨，并持续上涨，直到我们没有买家，或直到供应增加到足 以吸收所有需求。 
>
> 价格因净看跌情绪而下跌，并持续下跌，直到没有卖家，或需求增加到能吸收所有 供应的地步。

### 3.2.2案例1

> 下图，价格多次反弹至 1.4600 附近的上方**阻力区域**。价格上涨意味着看涨情绪和看 涨订单流。然而，反弹多次在该水平受阻，价格下跌。价格从这一水平下跌的唯一可能是 出现以下两种情况之一： 
>
> 1.交易商对高价买入不感兴趣。需求已经枯竭，市场不再急于做多。 
>
> 2.较高的价格对卖盘很有吸引力。多头获利了结。新的空头进入市场。供应（卖出） 的增加吸收了剩余的需求。
>
> 这两个原因的最终结果是，导致价格上涨的看涨压力不再能克服看跌压力。价格将下跌， 在阻力位形成新的波段高点。
>
> 下图，请注意价格多次跌向下方支撑区域，即 1.4420-25 附近。价格下跌意味着看 跌情绪和看跌订单流。然而，价格多次在该水平或略高于该水平时止跌回升。价格从这一 水平反弹的唯一途径是出现以下两种情况之一：
>
> 1.交易商对低价出售不感兴趣。供应已经枯竭，市场不再急于做空。
>
> 2.较低的价格对买盘很有吸引力。空头获利了结。新的多头进入市场。需求（买盘） 的增加吸收了剩余的供应
>
> 这两个原因的最终结果是，导致价格下跌的看跌压力不再能克服看涨压力。价格将上涨， 在支撑位形成新的波动低点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407040933447.png)

### 3.2.3案例2

> 踏空的交易者
>
> 亏钱的交易者
>
> 赚钱的交易者
>
> 波段高低点
>
> 在我们的讨论中，首先要考虑的是那些在最初向 A 多头移动之前建立了多头头寸的交易 者的想法和恐惧。
>
> 有些人会担心从 A 到 B 的下跌强度。请注意，A 的反弹经历了三次价格波动，而回落至 B 的价格却是一次迅速波动，甚至跌破了水平线标记的先前波动低点。这是相当看跌的波动。 A 处的获利了结，加上可能引入新的空头，已相当强劲地推动价格回落。
>
> 看到如此强劲的看跌走势，持有多头头寸的交易者自然会后悔没有在 A 点获利了结，因 为当时的价格比现在要高得多。那么他们 可以在 B 持有时再次买入（加速震荡上升至 A 的起始点），以获得第二次获利机会。
>
> 交易者后悔错过了在 A 卖出的机会，如果它再次出现，交易者将决心不会错过同样的机会。如果价格能够回到 A，他们就会准备好卖出订单。
>
> 这导致反弹在 C 点暂停，因为获利了结再次限制了上涨趋势，即使只是暂时的。
>
> 但是，您会注意到，从 B 到 C 的波动也是相当看涨的。一些最初决定在 C 点获利了结的 交易者会改变主意，重新（尽管是谨慎的）充满信心地持有。
>
> 在 B 点第二次入场的新多头同样会充满信心地持有。
>
> 然而，这种信心受到严重削弱，因为 D 点未能在 A 点上方推动多少距离。无法推高意味着要么在这些较高的价格缺乏新的买盘，和/或由于空头预期反转，而引入新的卖盘。在这些水平上，市场情绪显然并不看涨，否则突破 A 点将导致另一次强劲的上涨。
>
> 更多的多头将在 D 点暂停时获利了结，从而增加抛售压力，进一步限制价格
>
> 现在来看看后期多头，他们在价格突破震荡高点 A 时，在进入震荡高点 D 的顶部进场。 这些交易者相当沮丧；他们错过了在 A 点和 B、C 点之间的绝佳获利机会，现在发现自己 正处于痛苦的长期下跌中，因为价格在 E 区域横盘震荡。
>
> 这些交易者将寻找任何机会来挽救局面，并发誓如果价格能够回到他们的入场点，他们将抓住机会以盈亏平衡的方式退出。
>
> 市场在 F、G 和 H 点为他们提供了机会。
>
> 这种抛售增加了新空头的看跌订单流，在图表上形成了这一共同区域内的阻力。
>
> 由于市场内的交易者认为 1.4600 左右的价格很高，因此存在卖出机会，因此形成了阻力。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407040941533.png)

> 考虑从 H 点向下的走势，特别是那些持有空头头寸的人的心态和思维过程。
>
> 他们预计买盘会在哪里再次进入市场，这可能会限制进一步的下行走势？他们将观察波动低点 B，并注意价格最后一次拒绝该水平并爆炸回升至 C 的速度。预期是，如果交易者之前在 B 点（1.4400/20 附近）发现了巨大的买入机会，那么他们可能会再次这样做。
>
> 当价格接近 B 方向时，空头将寻求获利了结，或者至少回补部分头寸。这种看涨需求（补空头的买单）将与新多头在回测 B 点时发出的其他买单一起，阻止价格下行
>
> 交易者对 B 方向支撑的预期已在 I、J、K 和 L 区域产生支撑。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407040941533.png)

### 3.2.4案例3

> 在这种情况下支撑变为阻力。在此过程中，我们将再次考虑交易者的思维过程和情绪及其如何影响他们的决策。
>
>
> 在 A 点之前，我们有一个既定的支撑区域，以绿线标记。看涨需求正在进入市场，限制了下行走势。多头止损点被设置在该区域下方。进场订单也被放置在支撑区域下方，突破交易者希望在此区域做空。
>
> 跌破 A 支撑位后，看跌压力骤增，所有这些卖单都被执行，将价格推低至波段新低
>
> 在这一点上，请考虑所涉及的各方。
>
> 首先，考虑 A 之前的多头，他们不太聪明并坚持持有自己的头寸。目前，他们正处于极度亏损和巨大压力之中，祈祷有任何机会能够实现盈亏平衡或至少尽可能接近盈亏平衡出局。如果价格回到突破点，他们承诺卖出其头寸平仓，就像他们在 A 处应该做的那样。
>
> 现在考虑一下那些错过了从 A 点向下移动的空头，诅咒他们错过了又一次良好的突破，运气太糟糕了。他们将祈祷价格再次测试突破点，以便他们有第二次做空的机会。他们向自己保证，如果有这个机会，这次他们一定会卖掉。
>
> 现在来看看那些抓住了最初走势的更聪明的突破交易者。他们会计划在波段低点的滞涨期 获利了结，然后寻找机会再次以更高的价格重新建仓，而最初的突破点绝对是最好的机 会。 
>
> 所有这些决定都会导致在 B 点出现上尾，在这里，看跌的订单流很快就会拒绝接受 A 点 附近任何更高的价格
>
> 交易者的决定导致之前的支撑现在变成了阻力。
>
> 买入或卖出的决定是通过参考当前价格与先前引起重大情绪反应的区域来做出的，特别是那些导致遗憾错过机会的区域，或那些使交易者陷入亏损头寸的区域。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041053642.png)

> 假设图表显示了一个坚实的阻力区域。如果价格回到该区域，交易者将预计阻力将再次守住。买盘将会枯竭，而卖盘将会增加。看跌压力将战胜看涨压力，导致价格下跌。对阻力的预期会导致订单流，从而限制进一步的向上运动，从而产生阻力。
>
> 这同样适用于可清晰识别的支撑区域。如果价格回到该支撑区域，交易者将再次预计支撑将保持不变。卖盘将会枯竭。买盘将会增加。看涨压力将克服看跌压力，导致价格上涨。对支撑的预期会导致订单流动，从而限制价格进一步下行，从而形成支撑。
>
> 支撑位是需求超过供给的区域，它限制了价格的下行。
>
> 阻力位是供大于求的区域，限制了价格的上行

## 3.4波段高点

> 波段高点是指价格从上涨转为下跌的任何转折点。我将波段高点 (SH) 定义为一个价格柱高点，前面有两个较低的高点 (LH)，其后有两个较低的高点 (LH)
>
> 下图
>
> 波段高点就是K线C。其他所有K线都参考这一条。
>
> K线A的最高价比K线C的最高价低
>
> K线B的最高价比K线C的最高价低。
>
> K线D的最高价比K线C的最高价低。
>
> K线E的最高价比K线C的最高价低。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041124832.png)

> 请注意，蜡烛 A 的高点不必低于 B。所有高点仅参考 C 的高点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041129429.png)

> 在多根k线形成相同高点的情况下，只要在多根k线形成之前和之后有两 根高点较低的k线，这根k线仍将被定义为波段高点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041131425.png)

## 3.5波段低点

> 波段低点是指价格由下跌转为上涨的任何转折点。我将波段低点 (SL) 定义为价格柱的低 点，其前有两个较高的低点 (HL)，其后有两个较高的低点 (HL)
>
> 下图
>
> 波段低点是K线C。其他所有K线都以它为参考
>
> K线A的最低价高于K线C的最低价。
> K线B的最低价高于K线C的最低价。
> K线D的最低价高于K线C的最低价。
> K线E的最低价高于K线℃的最低价

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041133166.png)

> 请再次注意，k线 A 的低点不一定高于 B 的低点，所有低点只参考 C 的低点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041135938.png)

> 在多根k线形成相同低点的情况下，只要在多根k线形成之前和之后有 两根k线的低点较高，则仍可定义为波段低点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407041136567.png)

## 3.6画支撑阻力

> 下图
>
> 1.S/R 线通常绘制在波段的高点/低点处，如果该位置更好地定义了 S/R 的区域，则可以将其绘制在其他位置，让影线向上/向下穿过S/R线
>
> 2.当波段高点/低点 穿过一个重要的整数位几个点时；我通常会将 S/R 线 放在该**整数位**，而不是上下几个点
>
> 3.左边的，我会将该区域可视化，就好像它包含波段高/低点的k线上影线或下影线以及包含实体一样，右侧展示了这一点，该区域包含红色波段高点k线的上影部和主体。
>
> 4.对于处于波段高点/低点的小k线，我可以将整根k线范围作为 S/R 区域。
>
> 5.如果k线的实体太大，那么我将查看市场结构或较低的时间范围，以便找到合适的区域。
>
> 6.我们并不只是假设这些区域将保持不变。它们会成 为我们关注的区域，我们会在这里寻找机会--有时期待该区域守住，有时期待突破

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042050826.png)

### 3.6.1案例5

> 下图
>
> ==波段高点 A 的k线图太大，无法完全确定阻力位。在这种情况下，我会使用从 波段高点 A 的顶部到波段高点 B 上方的突破点之间的区域。==
>
> C 处的阻力由上尾线确定。
>
> D 处的支撑位由下尾线确定。
>
> 波段低点 E 的尾部相当大。我不会将整个区域都包括在内，而是将支撑区域标记为突破 F  处拥堵区域低点的尾部部分。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042104491.png)

### 3.6.2案例6

> 阻力区域由波段高点 A 和随后的横向拥堵区域顶部定义。我会将这一区域 简单地标记为上影部。
>
> 支撑位由波段低点 B 确定。我会在波段低点 B 处绘制支撑区域，将窄幅k线的整个范 围包围起来

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042138317.png)

## 3.7缺口支撑

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042045054.png)

# 4.0多时间框架分析

> 选择的时间框架越高，交易者可获得的大局观就越大。选择的时间框架越低，交易者可获得的细节越多。
>
> 不过，我的首选，当然也是我建议所有交易者在学习交易时使用的三种时间框架。
>
> 误区：新手交易者在尝试多时间框架分析时的一个常见错误是试图在所有时间框架上找到趋势的 一致性。也就是说，他们试图在所有三个时间框架上确定一个上升趋势（或在所有三个时 间框架上确定一个下降趋势），然后只沿着该趋势的方向进行交易。这严重限制了机会， 同时也相当无效。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042155495.png)

> 较高的时间框架：为市场提供了一个结构或框架。**通过识别支撑和阻力区域**，我们可以确定 市场中会对交易时间框架趋势形成阻碍的区域。我们已经确定了战场。
>
> 交易时间框架：在这一交易时间框架内进 行波动交易，无论市场是处于趋势还是横向波动。为此，我们了解过去的价格走势，评估 价格走势的强弱，并确定未来价格走势的可能路径。
>
> 较低的时间框架为我们提供了更精细的细节，以便对我们的交易时间框架分析进行微调， 让我们能够放大观察内部的供求力量；
>
> 我们按照交易时间框架进行交易。但我们通过将这种价格行为置于更高的时间框架结构的背景下来做到这一点。
>
> 我们交易时间范围内的趋势可能只是较长时间范围横盘市场内的价格波动。多重时间框架分析使我们能够警惕较高时间框架障碍区域的潜在趋势反转。
>
> 突破交易时间框架上的阻力可能只会将我们推向更高的时间框架阻力区域。因此，我们将关注看涨和看跌情绪的变化，寻找突破失败的迹象。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042200312.png)

## 4.1分析案例

> ==此时的关键是看各时间框架是如何相互作用的。尤其是，如何将交易时间框架的价格行为 与更高时间框架的支撑或阻力结合起来==
>
> 交易时间框架（3 分钟）是在较高时间框架（30 分钟）结构的背景下进行交易 的，较高时间框架阻力为我们的交易时间框架趋势提供了障碍。较低的时间框架（1 分钟 ）用于微调分析以及我们的进入和退出决策的时机
>
> 
>
> 下图显示的是较高时间框架30min
>
> 阻力区通过红线显示。支撑区域通过绿线显示。请注意从绿色变为红色的区域。在本示例中，我们感兴趣的区域被标记为 B 点 ，价格在该点返回测试阻力区域

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042211358.png)

> 下图显示了交易时间框架3min
>
> 我们在此分析价格走势并寻找交易机会 。忽略之前的机会，只关注 B 点的回测。
>
> 上升趋势的市场正在向阻力区域推进，事实 上已经略微突破了该水平。我们将在此观察两个主要机会中的一个--最大的可能性是突破 该水平，但很快就会失败；第二个可能性是突破，突破后继续沿着突破方向前进

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042216695.png)

> 下图的较低时间框架1min
>
> 显示了更多细节，让我们看到在突破前一波段高点，1.4500 水平和阻力区域时，势头明显放缓
>
> 考虑那些在突破这些区域时买入的交易者。当价格到达 1.4510 时，他们的止损点可能就 在零点水平之下。这就是我们要做空的位置，目的是在过度延伸的 3 分钟图表向下交易。 注意到这是从反趋势上看，我们的初步目标就在前期震荡低点上方，即 1.4470 附近。 在阻力区失败时入场，在接下来的 6 到 7 分钟内，价格很容易移动到我们的目标。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042219273.png)

## 4.2多时间框架支撑位和阻力位

> 在讨论和交易我的策略时，我会提到以下两种主要的 S/R 类型：
>
> 1.在较高时间框架图上确定的 S/R 被称为支撑位或阻力位。
>
> 2.在交易时间框架图上确定的 S/R 简单地称为波动高点或低点。
>
> 较高时间框架的 S/R 在交易时间框架图上也会很明显，而 在较高时间框架的图表上，交易时间框架的波段高点和低点往往微不足道。
>
> S/R - 支撑位和阻力位
>
> Spt - 高时间框架支撑位
>
> Res - 高时间框架阻力
>
> Swing H/L - 交易时间框架转折点
>
> SL - 交 易时间框架支撑点
>
> SH - 交易时间框架阻力点

# 5.0市场结构

> 为什么我们不会自动在支撑位下买单，在阻力位下卖单。这 些只是我们关注交易（3 分钟）和较低时间框架（1 分钟）价格走势的区域。价格在这些 区域的反应将决定我们对未来价格走势和交易机会的判断。
>
> 我们的市场结构遵循两个原则：
>
> 原则 1 - 价格在支撑位和阻力位的结构框架内波动。
>
> 原则 2 - 突破结构框架的支撑位或阻力位将导致价格在下一个框架区域波动
>
> 通过识别支撑和阻力区域，我们可以确定市场中将形成交易时间框架趋势障碍的区域。
>
> 我们已经确定了战场。 然后，根据交易者的决策，价格在这些水平所定义的框架内，在支撑位和阻力位之间来回 波动。 
>
> 这些 S/R 障碍并非坚不可摧。它们是价格的决定区域，随后价格将根据市场情绪反转或突 破障碍

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042302630.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042303175.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042303629.png)

## 5.1构建我们的结构

> 构建更高时限结构的过程很简单
>
> 1.打开高时间框架图
>
> 2.识别并 标记 S/R 区域
>
> 虽然识别 S/R 的规则相当客观，但并非所有 S/R 水平都会在图表上标出
>
> 波段高点 A 清晰地定义了阻力区域，使价格暂时止步于区域 C；波段低点 B 清晰地定义了 支撑区域。
>
> 波段高点 D 形成新的阻力区，在所显示图表的剩余时间内支撑着价格。波段低点 E 形成 新的支撑区域，在该图表剩余的价格走势中再次支撑住价格。
>
> ①波段高点低点
>
> ②拥堵区
>
> ③上影线下影线
>
> ④锤子线

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407042305865.png)

> 严格遵守波段高点和低点的定义，图表上每隔 10-20 个点就会出现一条支 撑线和阻力线
>
> 在这种情况下，我们需要在头脑中缩小范围，只选择最相关的层级。
>
> 我们的目的只是要找出那些在图表上最明显的关键转折点，从而为未来的价格走势提供潜 在的障碍

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050030249.png)

> 不要把问题想得太复杂。其实很简单，"如果它看起来像相关的 S/R 级别，那么它可能就是

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050032035.png)

## 5.2最佳支撑压力

> 绝对不能遗漏的最佳 S/R，就是那些在价格最后离开该区域时显示出 最大供需失衡的价位。
>
> 也就是说，多头和空头之间的紧迫性差异最大，导致价格快速波动的时候
>
> 这一点在显示价格快速反转的波段高点和波段低点，以及导致价格突然强劲突破且后续表现良 好的拥堵区域都很明显
>
> 下图
>
> 对1.4650价位的快速拒绝，显示出更严重的供需失衡，如果价格返回这一区域，那么它将是一个更高质量的支撑位

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050036253.png)

## 5.3案例1

> 市场上方的阻力位 R1 位于 1.5000 和 1.5015 之间的波段高点，该阻力位限制了上行空间
>
> 根据亚洲时段早盘的==拥堵和突破情况==，当前价格下方 1.4920-30 区域存在支撑位 S1
>
> 根据 6 月 23 日美国时段的波段低尾，S2 支撑位存在于 1.4850-70
>
> 6 月 23 日的==波段低点和拥挤程度==，S3 支撑位存在于  1.4800。请注意，在这种情况下，潜在支撑区域将延伸至 1.4840，在此位置，动能才真正 爆发上涨

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050038435.png)

> 下图
>
> 高时间框架30min价格的接下来的六个小时进一步走势
>
> A 标志着英国时段的开盘。请注意这根k线（标记为 B）的尾部较低，显示我们的  1.4900-20 支撑区域提供了一些支撑。一旦价格突破该区域，下一步会走向何方？直奔我 们的下一个支撑区域 S2，即蜡烛图 C 的较低尾部
>
> 我们采用较高时间框架结构的目的是确定价格变动的框架。如果我们能准确地做到这一点 ，随后的价格走势就会在较高时间框架的支撑和阻力区域之间移动。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050042864.png)

## 5.4案例2

> 下图
>
> 阻力 R1 位于价格上方 1.4840-60 区域，基于上一交易日美国时段顶部的尾线。阻力 R2 位 于 1.4825-35，基于向下突破前的波段高点。阻力位 R3 和 R4 根据美国尾盘时段的拥堵情 况定义了一个阻力区域 1.4720-40，该阻力区域的低位在随后的亚洲时段对价格形成了限 制）
>
> 支撑位 S1 位于 1.4685-95，基于近期和前期价格走势的波动低点。支撑位 S2 位于 1.4645 65，基于之前的波动低点和左侧的拥堵。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050044178.png)

> 下图
>
> 接下来几个小时的价格走势
>
> 6 月 17 日英国时段开盘时，价格直接击穿了亚洲时段区间下沿支撑位 S1，止步于下一个 支撑位 S2。在 30 分钟图表上，这表明突破失败，因为价格随后反转并穿越亚洲时段区间 上行。
>
> 阻力位 R2 起初减缓了 B 处的价格上涨，然后下一个更高的阻力位 R1 为 C 处的价格上涨 提供了最后一道屏障，并确定了英国和美国时段剩余时间的高点。
>
> D 点是一个很好的例子，说明为什么我们不会自动在支撑位下买单，在阻力位下卖单。这 些只是我们关注交易（3 分钟）和较低时间框架（1 分钟）价格走势的区域。价格在这些 区域的反应将决定我们对未来价格走势和交易机会的判断。
>
> 尤其是像 D 区这样的区域，它们定义了亚洲时段的上下边缘。这些 S/R 区域在外汇世界中 受到普遍关注，许多交易者都希望在突破该区间时进行交易。同样，我们不会自动交易突 破。我们观察这些区域，寻找机会，最终可能是对该区域的成功测试、突破或突破失败（ 更多内容将在以后我们学习交易时介绍--目前我们只是在定义结构）

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407050045120.png)

# 6.0发展趋势

> 趋势支撑位和阻力位——波段高点和波段低点
>
> 指导价格走势的原则在所有时间框架上都是相同的。价格走势是供求关系的函数。它在之 前的供需失衡区域之间移动，这些区域被定义为支撑位或阻力位。
>
> **在较高的时间框架30min上，我们根据较高时间框架的支撑位和阻力位定义了一个结构。**
>
> 在这一结构中，价格仍在较短时间框架的支撑和阻力区域之间移动。
>
> 在交易时间框架（3 分钟）上，我将它们简单地称为波段高点 (SH) 和波段低点 (SL)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051559809.png)

> 重要的是要记住，这些波段高点和低点构成了交易时间框架 S/R，有可能影响未来的价格 走势，如下所示。波段高点/低点是之前供需失衡的区域，其他交易者在做出交易决策时 会参考这些区域。
>
> 虽然我在上图中用标签和线条标出了波段 H/L，但这只是为了演示。通常情况下，我的图 表不会显示标签或线条，因为这些波段 H/L 区域通常是肉眼可见的。在交易过程中，我唯 一会在图表上标注波段 H/L 线的情况是，那些线在图表左侧未能显示的部分延伸过来
>
> 与较高的时间框架 S/R 一样，在蜡烛重叠较多的波动市场中，您可能需要在心理上从噪音中退一步，只选择那些最明显的水平。不要害怕一点主观性。就像较高时间范围内的 S/R 一样，如果 它看起来像一个重要的波段高点或低点，那么它很可能就是。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051602973.png)

## 6.1客观定义趋势

> 在这些波段高点波段低点之间的价格变动将形成趋势，即上升趋势、下降趋势或横盘趋势（交易 区间）。
>
> 图表上对确定趋势变化或延续非常重要的区域是之前供需失衡的区域，即确定趋势的波动 低点和高点。

### 6.1.1上升趋势

> 上升趋势包括以下重复序列：
>
> 1.向上延伸
>
> 2.波段高点
>
> 3.向下回调 
>
> 4.波段低点
>
> 5.价格延伸比回调长
>
> 6.延伸将突破前一波段高点，达到该趋势的价格新高
>
> 7.回调不会跌破前一波段的低点
>
> 这导致了一系列较高的波段高点和较高的波段低点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051609306.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051610145.png)

> 当价格跌破趋势最高波段高点之前的波段低点时，上升趋势结束。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051612620.png)

> 如果价格没有突破最高高点之前的波段低点,那么只能表明那是一波复杂的回撤，而非反转

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051613361.png)



> 上升趋势--从供需和交易者决策的角度来看
>
> 由于交易者出于某种原因认为波段**低点很有价值**，因此形成了一个支撑区域。新的多头头 寸建立起来，看涨情绪导致价格上涨。
>
> **看涨压力战胜看跌压力**，形成向上延伸。交易者继续做出买入决定，并愿意继续以更高的 价格买入，以进入这个市场，将价格推向新高。
>
> 在某一时刻，**短期多头将获利了结**，新的空头将被更高的价格吸引入市。看跌压力的增加 将克服看涨压力，形成顶部形态；趋势阻力区域形成波段高点。
>
> 跌破波段高点会吸引更多的看跌订单流，因为更多的多头会获利了结（已认识到波段高点 的阻力），而更多的空头会被吸引到市场中来。
>
> 价格回调是指看跌压力暂时压倒看涨压力，从而推动价格下跌。交易者正在做出卖出决定 ，并愿意继续以较低的价格卖出，以完成订单。
>
> 这并不一定是趋势反转的迹象。因看跌情绪而出现的较低价格无法吸引足够的看跌订单流 来打破前一波段低点，从而导致趋势反转。相反，这些较低的价格会吸引更多买盘，足以与看跌订单流相匹配，并阻止回调。随着吸引更多买盘和空头回补头寸，市场情绪再次转 为看涨，因为空头认识到价格向下波动只是回调而非反转。一个新的趋势支撑区域形成 了更高的波动低点。
>
> 看涨情绪再次导致从这一波段低点区域反弹，这一过程不断重复。
>
> 有趣的是，上升趋势中的看涨压力并不仅仅来自新的买入决定。请记住，每笔交易都涉及 买入和卖出。价格变动是所有交易者净交易决策的结果，也是一方比另一方更急于交易的 结果。上升趋势中的看涨压力大多来自空头（试图选择反转的空头）对亏损头寸的退出。
>
> 考虑一下大多数交易者（那些持续亏损的人）的心理和思维过程。由于未能抓住上升趋势 ，现在又看到价格上涨，这些交易者被消极的想法和情绪--后悔、愤怒和最终的报复--所 吞噬。他们知道价格波动不可能永远持续下去，因此会在出现潜在停滞或阻力的第一个迹 象时做空，希望尽早进入趋势反转。通常他们都错了。即使他们是对的，并设法在波段高 点或附近把握了入场时机，但这通常只是暂时的，因为下跌波段被证明是持续上涨趋势中 的回调，而不是趋势反转。受情绪影响的交易者会在止损点被触及时被迫补仓（买入）， 通过另一次管理不善的亏损交易再次造成净亏损。
>
> 在上升趋势中，看涨压力的很大一部分是亏损空头（通过买单）退出头寸。从很多方面来 看，看跌一方的亏损都会助长上升趋势。

### 6.1.2下降趋势

> 下降趋势包括以下重复序列：
>
> 1.向下延伸 
>
> 2.波段低点
>
> 3.向上回调 
>
> 4.波段高点 
>
> 5.价格延伸比回调长。 
>
> 6.延伸将跌破前期波段低点，达到该趋势的价格新低。 
>
> 7.回调不会突破前一个波段的高点。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051622555.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051624798.png)

> 当价格突破趋势的最低波段低点之前的波段高点时，下降趋势结束

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051627993.png)

> 未能突破最低波段低点之前的波段高点，可能表明只是一波复杂的回撤，而非反转

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051628203.png)

> 下跌趋势--从供求关系和交易者决策的角度来看
>
> 由于交易者出于某种原因认为波段高点被高估，趋势阻力区已经形成。新的空头头寸建立 ，看跌情绪导致价格下跌。
>
> 由于看跌压力战胜了看涨压力，市场向下延伸。交易者继续做出卖出决定，并愿意继续以 更低的价格卖出，以进入这个市场，从而将价格推向新的低点。
>
> 在某一时刻，短期空头将获利了结，而新的多头将被较低的价格吸引入市。看涨压力的 增加将克服看跌压力，形成筑底形态；趋势支撑区域形成震荡低点。
>
> 从震荡低点开始的反弹会吸引更多的看涨订单流，因为更多的空头会获利了结（已认识到 震荡低点的支撑），而更多的多头会被吸引到市场中来。
>
> 价格回调涉及看涨压力暂时战胜看跌压力，从而推动价格上涨。交易者正在做出买入决定 ，并愿意继续以更高的价格买入，以便完成订单。
>
> 这并不一定是趋势反转的迹象。看涨情绪导致的较高价格无法吸引足够的看涨订单流来突 破前一波段高点，从而导致趋势反转。相反，这些较高的价格会吸引更多的卖盘，足以与 看涨订单流相匹配，并阻止回调。随着吸引更多卖盘，多头回补头寸，市场情绪再次转为 看跌，因为他们认识到，价格上扬只是回调，而非反转。一个新的趋势阻力区形成，成为 较低的震荡高点。
>
> 看跌情绪再次导致价格跌破这一波段高点，这一过程再次重演。
>
> 有趣的是，下跌趋势中的看跌压力并不仅仅来自新的卖出决定。请记住，每笔交易都涉及 买入和卖出。价格变动是所有交易者净交易决策的结果，也是一方比另一方更急于交易的 结果。在下跌趋势中，大部分看跌压力来自于多头（试图选择反转的多头）退出亏损头寸 。
>
> 考虑一下大多数交易者（那些持续亏损的人）的心理和思维过程。由于未能抓住下跌趋势 ，现在又看到价格下跌，这些交易者被消极的想法和情绪--后悔、愤怒和最终的报复--所 吞噬。他们知道价格波动不可能永远持续下去，因此在出现滞涨或潜在支撑的第一个迹象 时就做多，希望尽早进入趋势反转。通常他们都错了。即使他们是对的，并设法在波段低 点或附近把握了入场时机，这通常也只是暂时的，因为事实证明上升是持续下降趋势中的 回调，而不是趋势反转。受情绪影响的交易者在止损点被触及后被迫退出多头头寸（卖出 指令），通过另一次管理不善的亏损交易再次造成净亏损。
>
> 在下跌趋势中，看跌压力的很大一部分是亏损多头（通过卖单）退出头寸。在许多方面， 下跌趋势是由看涨一方的亏损者推动的。

### 6.1.3震荡趋势

> 横盘趋势由一系列价格波动组成，这些波动存在于一个重要的上方阻力区域和一个重要的 下方支撑区域的范围内。区间支撑和阻力边界（区间下边界和上边界）可由较高时间框架  S/R 和/或重要交易时间框架波动高点或低点形成

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051633398.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051633643.png)

> 当四个趋势转折点（SH 和 SL）在之前的价格波动范围内形成时，横盘趋势就开始了。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051633969.png)

> 少于四个转折点可能只是一个复杂的（三段）回调，而不是趋势的改变。需要四个转折点才能表明变为横盘趋势

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051638074.png)

> 我将横盘趋势的正式结束定义为价格突破横盘趋势的最高点或最低点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051639126.png)



> 横向趋势--从供求关系和交易者决策的角度来看
>
> 决定性的价格波动确立了一个较低的价格区域（支撑位），交易者认为在此区域会有一个 良好的买入机会。在市场情绪发生变化之前，价格向该区域移动将导致新的多头进入市场 ，而空头则在下跌中获利了结。这种看涨订单流将战胜任何看跌订单流，价格将反弹并保 持在确定的范围内。
>
> 与此相反的情况则发生在价格上沿区域（阻力位），交易者认为这是一个良好的卖出机会 。在市场情绪发生变化之前，价格向这一区域移动会导致新的空头进入市场，而多头则会 在价格上涨后获利了结。这种看跌订单流将战胜任何看涨订单流，价格将下跌并保持在确 定的范围内。



> 下图
>
> 我们很容易直观地将其识别为下降趋势。按照波段高点和低点以及趋势变化的严格定义，我们发现趋势从下降趋势转变为上升趋势（在 3 处）只维持了一个刻度，然后又 反转继续向下

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051726744.png)

> EMA 系统无法充分定义横向趋势是其主要问题之一

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051731194.png)

> 我们允许价格测试潜在趋势变化的价位。我们甚至允许价格超过这些价位。趋势变化并不是由突破触发的。相反，它是 价格接受这一新区域的结果
>
> 突破后，价格是否会迅速拒绝这个新区域并返回到原来的趋势定义，或者价格是否守住突破并继续？
>
> 在这个例子中，由于我们没有看到接受突破价格的证据，因此目前的下降趋势仍然保持不 变。在我们看到行为变化的确凿证据之前，趋势不会被认为发生了变化。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051744362.png)

## 6.2主观定义趋势

> 当市场处于==趋势==时，EMA 交叉系统确实能提供一个很好的近似趋势指标。
>
> 如果您确实在图表上使用了 EMA，请务必将其仅用作指导，而不是实际的趋势定义
>
> ==主观定义趋势==虽然难以被新手交易者接受，但却更胜一筹。

> 主观判断允许打破定义--通过价格在这些关键时刻的反应，依靠反应来判断方向
>
> 它是会维持在该水平之上(价格接受)，还是会失败(价格拒绝)？
>
> 在趋势定义被打破后，对价格接受程度的主观评估，实 际上意味着趋势只是视觉上看起来是什么就是什么。这并不意味着我们完全猜测趋势。我们知道波段高点/低点的趋势定义，但会在此基础上 运用一些主观因素。
>
> ==基本上，如果看起来像上升趋势（价格似乎从左下方移动到右上方），那就是上升趋势。 如果看起来像下降趋势（价格似乎从左上方向右下方移动），则是下降趋势。其他都是横 盘趋势。==

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051750653.png)

### 6.2.1案例1

> 下图
>
> 我们的上升趋势由趋势低点 A、趋势高点 B、趋势低点 C、趋势高点 D 、趋势低点 E、趋势高点 F、趋势低点 G 和趋势高点 H 确定。
>
> 由于 G 的重要性，我标记了 F 和 G。这根k线最初向下移动，在 F 回测 D 之后继续走低 ，然后迅速反转，向上反弹。这一走势的速度会使一些空头陷入亏损境地。这是一个重要 区域，因此适合选择作为波段低点。如果价格跌破这一水平，则表明市场的供需动态发生 了变化。
>
> 波段低点 G 是最高波段高点 H 之前的最后一个波段低点。因此，客观趋势定义从上升趋 势变为下降趋势，是在波段低点 G 的低点被突破时发生的
>
> 我们希望看到价格接受这一变化的证据。在趋势变化水平下方的第一次收盘是强烈的看跌 ，随后出现了三根微弱的看涨k线，表明缺乏需求（如果有明显的需求，价格就会拒绝突 破，并反弹突破该水平）。继续走低确认了我们的趋势变化。
>
> 另外，使用我们的“如果它看起来下跌，那么它就在下跌”的规则，加速下跌至I，弱势回撤至J，对我来说，使得这看起来向下的力量。
>
> 从波段高点 H 到波动低点 I、拥堵点 J、波动低点 K、波动高点 L、波动低点 M，下降趋 势在继续
>
> 波段高点 L 是波段低点 M 之前的最后一个波段高点。根据我们对客观趋势的定义，价格 突破 L 表明趋势转回上升趋势
>
> 下一根k线显示出停顿。从主观上看，由于快速上升到 L 区域，趋势有可能发生改变，但 需要在接下来的一两根k线中获得更多信息，才能接受上升趋势的改变，或者拒绝这种改 变并继续下跌。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407051752529.png)

### 6.2.2案例2

> 下图
>
> 我们有一个由波段低点 A、波段高点 B、波段低点  C、波段高点 D、波段低点 E 和波段高点 F 定义的上升趋势。请注意，波段低点 E 并未将 价格带向新高，因为波段高点 F 并未超过 D 的高点。价格必须跌破 C，才能触发下降趋势 的改变，当然在本例中并没有出现这种情况
>
> 经过 E、F 和 G 的 3 个波段回调后，上升趋势得以延续，并在 H 处创下新高。
>
> 在较大的延伸（如从 C 到 D）之后，你经常会发现 3 个波段的回调或其他形式的复杂回调 （注意价格在均线上方的距离，这表明可能存在过度延伸--将 EMA 叠加在价格行 为上作为支撑工具的另一个直观优势）。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052108225.png)

> 下图
>
> 英国外汇交易时段开始时存在一个下降趋势，通过之前的价格走势，进入波段高点 A、波段低点 B 和波段高点 C。趋势不会因更高的波段低点的确认而改变，也 不会因波段高点 C 的突破而改变，因为它不会将价格推向新的低点。如图所示，当价格突 破波段高点 A 时，趋势发生改变，因为波段高点 A 是最低波段低点 B 之前的波段高点。价格接受了突破和趋势定义的改变。波段低点 G 是一个较低的高点，随后是较低的低点 H。此 时，趋势并未改变，因为波动 F-G-H 可能只是持续上行趋势中的一个复杂回调。如果继续 回到 E 以上，就可以证明这一点
>
> 在这种情况下，价格未能突破 E 点，在 I 点形成了另一个波段高点。此时，我们有了四个 波段或转折点（从 E 到 F、G、H 和 I），确认了从上升趋势到横盘趋势的转变。定义横向 趋势或交易区间的上方阻力区域将是位于 E 点的波动高点。定义横向趋势的下方支撑区域 将是波动低点 D，但鉴于波动低点 B 与英国外汇交易时段的最低价格非常接近，我个人将 波动低点 B 定义为需要突破才能触发下降趋势的区间支撑区域。这就是您在分析时应运用 主观性的一个例子。
>
> 从主观的视觉角度来看，我也乐于将其定义为横盘趋势。早先的需求显然已经耗尽，价格 也没有再创新高。同样，下行趋势也并不强劲。在我看到一方开始占据主导地位的行为变 化之前，英国时段早盘的区间（B 到 E）很可能将决定本时段剩余时间的上下限。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052117117.png)

### 6.2.3案例3

> 下图
>
> A 和 B 标志着 2010 年 7 月 2 日非农就业数据公布后的下方支撑位和上方阻力位。在非农就业数据公布后的短暂波动之后，价格明显处于横盘区间内。在价格跌破 A  或突破 B 之前，横盘趋势一直有效
>
> 在 C 点，价格两次突破下部支撑位，但都未能接受和维持这些突破价格。客观趋势变化被 推翻，趋势被评估为保持横盘（在7 月 4 日长周末之前，这也并非完全出乎意料）。
>
> 但要注意的是，到达 D 点的走势非常微弱，无法形成更高的波段高点。价格跌回 A 点以 下，足以让我主观地将趋势转变为下降趋势。
>
> 新的波段低点 E 已经确立，随后是一些磨人的横盘走势，显示双方都没有真正占据优势。 若要继续下跌趋势，就必须继续跌破这一阻力位。如果回落到 D 水平以上，则表明 A 水 平以下将遭到进一步拒绝，并将回到横向趋势环境中。
>
> 事实证明，无论从主观还是客观角度来看，第二种方案都是正确的。
>
> 波动高点 D 是最低点之前的最后一个波动高点。从 E 向上到 F 的强劲走势突破了波段高点 D，使下降趋势失效。横向趋势重新确立，因为突破波段高点 D 后，价格回到原来横向 趋势的范围内。
>
> 上方横向趋势阻力位仍为 B 点，下方支撑位定义为导致价格回归横向趋势的波动低点，在 本例中为波动低点 E。

# ![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052122786.png)7.0未来趋势

> 我们通过分析价格走势的各种特性，特别是通过分析动量、预测和深度，来确定趋势的强弱。
>
> 该分析主要在我们的交易时间框架（3 分钟）上进行，但也会根据需要通过较低的时间框 架（1 分钟）进行微调。
>
> 确定价格可能的走向
>
> 确定未来趋势的概念如下：
>
> 1.价格走势为两股对立力量（看涨和看跌压力）的强弱提供了线索，让我们看到哪一方 赢得了价格流的控制权。
>
> 2.未来的价格走势很可能与力量强大的方向一致，或与力量弱小的方向相反。
>
> 也就是说，在看涨和看跌压力的竞争中，我们感受到了市场的强弱，并通过预测来确定未 来可能的价格走势。
>
> 下图
>
> 下降趋势波段时的强势（a）和回撤时的弱势（b）
>
> 下跌趋势继续沿着之前的强势方向（a）和弱势方向（b）发展。
>
> 在强势延伸（c）和较弱回调（d）的情况下出现延续。力量仍然偏向看跌。
>
> 延长线（e）显示继续看跌，而回撤线（f）再次走弱。由于看跌力量仍在，下跌走势再 次持续。
>
> 延伸段（g）最初显示出强势，但随后通过延伸段（h）大幅减弱。通过延伸段（g/h） ，看跌压力显示出大幅减弱的迹象--肯定弱于之前的延伸段（e），现在也弱于上次的 回撤段（f）。
>
> 接下来的走势是顺着上次强势（f）的方向，逆着弱势（h）的方向。价格波段（i）的 反弹相当强劲。
>
> 并不总是像这个例子看起来那么容易。通常没有明确的信号。很多时候，看涨和看跌的 价格波动会表现出相似的力度。
>
> 然而，任何方向上的强弱突变在图表上几乎都是显而易见的，就像这里发生的一样，摆动 （g）的势头通过（h）变得平缓。
>
> 强弱的变化往往很容易识别。而这些突如其来的变化也为今后的发展提供了很好的线索 。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052234385.png)

## 7.1动量

> ==观察价格走势，以注意速度和加速度的变化；评估 这种变化对未来潜在订单流量和未来潜在趋势方向 的 意义==
>
> ==越靠近y轴动量越大，角度越小动量越大==
>
> 价格变动的斜率（角度），可以在图表中看到动量
>
> 下图
>
> 纵轴显示价格、横轴显示时间
>
> 直线的斜率代表价格的速度，即单位时间内价格的变化率。
>
> 较浅的线（蓝色）与较陡的线（红色）相比，表示同一时期价格上涨较少。因此，蓝线比 红线代表的速度更慢。与红线相比，蓝线显示的看涨势头较弱。与红线相比，蓝线显示看 涨疲软。与蓝线相比，红线显示看涨力量。
>
> 曲线的斜率代表加速度或减速度，即速度的变化率。
>
> 斜率下降（红线）表明速度在下降。该价格波段内的动量正在减少，表明价格波段正在走 弱

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052242643.png)

> 左图直线
>
> 较浅的线（蓝色）与较陡的线（红色）相比，表示同一时期内价格下降的幅度较小。因此 ，蓝线比红线代表的速度更慢。与红线相比，蓝线显示的看跌势头较弱。与红线相比，蓝 线显示的是看跌弱势。与蓝线相比，红线显示看跌力量。
>
> 图表右侧代表看跌的加速和减速。
>
> 斜率（蓝线）的增加表明速度在加快。这一价格波动的动量在增加，显示出看跌力量在增 强。
>
> 斜率减小（红线）表明速度减小。在这一价格波动中，动量正在减少，表明价格波动中出 现了疲软。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052245257.png)

### 7.1.1动量分析注意点

> ==动量分析不是测量动量的绝对值，而是将当前的价格行动动量与之前的价格行动动量进行 比较。==
>
> 1.将当前价格波动的动量与之前==同方向价格波动的动量==进行比较？价格比之前是快了 还是慢了？这意味着什么？
>
> 2.将当前价格波动的动量与之前==价格波动的动量进行反向==比较？价格比之前是快了还 是慢了？这意味着什么？
>
> 3.当前的价格是==加速还是减速==？这意味着什么？

#### 7.1.1.1同向比较

> 将当前价格波动的 动量与之前同方向价格波动的动量进行 比较？价格比之前是快 了还是慢了？这意味着什么？
>
> 下图左侧
>
> 我们可以看到下降趋势正在减弱，并逆转为上升趋势。
>
> 比较下波段a，c和e的斜率。请注意，每段下跌的速度都有所下降，表明看 跌势头减弱。看跌一侧出现疲软。
>
> 比较b和d的上升斜率。请注意，每段上升的速度都在加快，表明看涨势头在增强 。看涨的价格波动正显示出强劲的迹象。
>
> 价格走势更有可能继续向强势方向发展，而与弱势方向背道而驰。当看涨势头增强，而看 跌势头减弱时，市场就会反转
>
> 在右侧，我们看到上升趋势正在减弱，并逆转为下降趋势。
>
> 比较(f)，(h)和(j)三个上升段。注意每段上升的速度都在下降，表明看涨势头减弱。看涨的 价格波动正显示出疲软的迹象。
>
> 比较下行（g）和（i）。注意这两条腿的速度都在加快，表明看跌势头在增强。看跌一方 的力量正在显现。
>
> 未来的价格走向更有可能继续看跌，看跌强势，看涨弱势。
>
> 价格波动的速度往往没有明显差异，这表明当前价格走势的强弱没有变化。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052251941.png)

> 价格波动速度a，c和e的比较显示出可比的势头 。看涨力量没有变化
>
> 同样，在下行阶段b，d和f，看跌势头也没有发生变化
>
> 在势头没有发生任何可观察到的变化的情况下，我们预期趋势将继续保持目前的状态。
>
> 这种情况会一直持续，直到价格走势出现动能变化的迹象，即强势或弱势。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052258246.png)

#### 7.1.1.2反向比较

> 将==当前价格波动的动量与之前价格波动的动量进行反向比较==？价格比之前是快 了还是慢了？这意味着什么？
>
> 也就是说，将当前的看涨波段与之前的看跌波段进行比较；或者将当前的看跌波段与之前 的看涨波段进行比较。
>
> 下图
>
> 注意（a）的斜率相当陡峭（几乎垂直），而（b）的斜率更多是 45%  的角度。与之前的下行（a）相比，最近的上行（b）显示出疲软。力量仍然是看跌方向 。 
>
> 下行（c）显示的下行速度与之前的上行（b）速度相当；如果有的话，下行速度可能稍强 。虽然力度仍然偏向看跌、 看跌和看涨之间的差异并不大。需要更多的信息来确定情绪的变化。
>
> 看涨上行（d）与上次下行（c）相比，速度略有增加。虽然现在的力量偏向看涨一方，但 再次出现了非常微小的差异。
>
> 然而，与看涨波段（e）相比，看跌波段（f）的势头大大减弱。 (d).注意（e）的角度较浅，而（d）的角度陡峭。现在的力量明显偏向看涨。
>
> 预计价格将向强势方向移动，与弱势方向背道而驰。趋势已转为向上；预计价格将沿着 这一新的趋势方向进一步波动。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052251941.png)

> 同样的分析技巧也可应用于顶 部反转。
>
> 下图
>
> 比较(f)和(g)可以看出，上升势头大于下降势头。力度仍与趋势方向一致。
>
> 波段(g)和(h)显示的势头相当。需要更多信息。
>
> 波动（h）和（i）显示了状态的变化。动量向看跌一方增强。
>
> 这一点在比较(i)和(j)的势头时得到了证实。上升势头 (j) 与下行势头 (i) 相比相当微弱。预计价格将沿着新的下降趋势进一步波动。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407052251941.png)

> 下图说明了为什么反向波段的对比有时会提供同向波段对比无法提供的一些信息。
>
> 在比较（b）、（d）和（f）的下行速度时，我们注意到看跌势头没有变化。没有证据 表明看跌方向减弱或增强。同样，在比较上升速度（a）、（c）和（e）时，我们注意 到看涨势头没有变化。没有证据表明看涨势头减弱或增强。
>
> 不过，比较相反方向的波动确实能为我们提供有用的信息。
>
> 对比（a）和（b），我们可以看到看涨波段比看跌波段更为陡峭。力量偏向看涨一方。 所有其他货币对（b/c、c/d、d/e、e/f）的情况也是如此，同样显示出强劲的上行势头。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407060006834.png)

#### 7.1.1.3加速减速

> 下图
>
> 显示价格在上升过程中减速。动量正在减弱。请注意，这并不一定预示着即将出 现反转。它只是表明当前的价格波动正在减弱，可能会出现下行调整。至于是否会发展成 全面的趋势反转，将取决于随后的价格走势。
>
> 同样，价格波段（b）显示下跌运 动减速。动量再次趋势方向减弱。下一步很可能是向上调整。另一方面，加速则更难分析。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407060010258.png)

> 下图
>
> 这可能表明当前价格波动方向上的动能在增强，价格继续朝该方向波 动的可能性更大
>
> 然而，极端水平的加速可能预示着加速耗尽后的疲软

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407060013649.png)

> 如下图所示，
>
> 这些高潮走势 往往以猛烈的方式结束，形成（至少）一个强大的支撑或阻力区域，偶尔也会出现快速反 转。 这些价格波动通常伴随着价格柱范围的大幅增加、远高于或低于任何平均线的延伸以及与 之前行动相比极高的成交量。
>
> 像价格看涨（a）这样的高潮走势代表了最后一批受情绪影响的公众，他们不顾一切地以 任何价格买入市场，将价格越追越高。当没有买家了，价格涨势停止时，市场上的卖盘就 会逆转价格，套牢所有后期多头。由于这些多头被止损（卖出指令），更多空头被吸引入 市，价格反转可能会相当迅速。
>
> 高潮走势（b）代表了同样的下行过程。后期空头在恐慌中拼命追逐越来越低的价格，而 前期多头则在极度缩减的情况下，在忍无可忍时退出。一旦卖盘耗尽，专业人士就会买入 ，推动价格上涨，将后期空头套牢在亏损的位置上。随着被套空头止损出局（买单），更 多的多头被吸引到市场中来，任何反转都可能再次相当迅速。
>
> 因此，价格加速确实预示着力量。但是，过度的加速是不可持续的，很可能以高潮衰 竭和潜在反转而告终。将加速程度与背景市场行为结合起来，通常就能识别出这两种 情况中的哪一种。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407060014483.png)

### 7.1.2案例1

> 下图
>
> 波段高低点的，之前获利的，亏损的，踏空的
>
> 展示了价格连续同向波动时的动量变化。
>
> 请注意，波段 C 的斜率比波段 A 浅，表明上升势头减弱。从波段 A 到波段 C，价格延伸 的速度有所减慢。
>
> 请注意，波段 D 的斜率比波段 B 更陡峭，表明下跌势头增强。看跌势头正在增强
>
> 这两项观测结果表明，我们的趋势正在减弱。
>
> 注意趋势尚未改变。除非价格波段继续向下，并突破波段低点 E（前一个波段高点阻力和 突破点，现为支撑点），否则不会触发下降趋势。
>
> 趋势仍然向上。但动量分析表明，趋势已大大减弱。
>
> 未来的趋势将通过即将讨论的过程来确定。目前，我们已经发现了上升趋势中的弱点；鉴 于 E 点可能存在支撑，从这一点上看，横盘整理的可能性很大。
>
> 让我们从交易者决策的角度来回顾一下这个例子。
>
> 价格波段 A 的快速延伸将导致许多交易者跳上这股上升趋势的大潮，对更高价格的潜力 感到非常兴奋。回调 B 会比他们希望看到的更深一些，约为之前延伸的 50%，但考虑到 延伸的速度，这并不完全出乎意料。如果其他多头错过了最初的走势，回调也为他们提供 了做多的机会。
>
> 然而，大多数新手交易者通常都会姗姗来迟，在任何走势的末期才进场。许多人都会在延 伸段 A 的后期买入，该区域随后形成了波段高点。这些交易者在回调过程中承受着极大的 压力，可能会寻找任何机会在盈亏平衡点或接近盈亏平衡点时出局。考虑到 C 的攀升速度 较慢，这些交易者不太可能恢复最初的热情，他们可能会在 C 的高点（如果幸运的话）或 更有可能在第二次回调 D 加速下跌时离场，从而增加看跌订单流。
>
> 同样，如果有人错过了 A 延伸段的开始走势，并在回调后进入了 C 延伸段，那么他们很 可能会在盈亏平衡时退出，或者在 D 延伸段价格下跌时止损，从而进一步增加看跌压力 ，削弱未来看涨订单流的可能性。
>
> 这导致了现在的价格。从这里开始，随着价格继续突破 B-C 波段低点，更多的止损点被触 及，我们预计下一根阳线将承受更大的看跌压力。
>
> 不过，任何看跌走势都将是短暂的。空头将在接近 E 点时获利了结。多头将在该区域进场 ，上次该区域显示出极大的看涨压力（他们不想再次错失良机）。看涨订单流应该会压倒 看跌订单流，从而形成支撑。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061528247.png)

### 7.1.3案例2

> 下图
>
> 注意每次下跌波段延伸的动能都在减弱，因为价格形成了圆形底部形态， 并在 1.4510 水平形成了新的支撑。
>
> 当第三个波段（C）向前期波段低点移动时，减弱的动能应该已经提醒您趋势正在发生变 化。供应不再像最初两次下跌那样压倒需求。要么是卖盘不足，要么是买盘增加。
>
> 无论如何，力量平衡已经发生了变化，空头不再是曾经的主导力量。
>
> 下跌趋势已经减弱。价格更有可能逆着疲软的方向（即多头方向）进一步波动。
>
> 如前所述，重要的不是动量的绝对值，而是一个价格波动与另一个价格波动的比较。在这 种情况下，每次价格波动速度的降低都是下跌趋势减弱的证据。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061545373.png)

### 7.1.4案例3

> 下图展示了减速现象
>
> 请注意，价格在开始时下降得相当快，但在结束时下降速度放 缓。
>
> 这是一个最初出现强大看跌压力的例子--交易者在突破高位k线图（射击之星）时退出多 头，空头进场，供大于求。最初的看跌压力未能持续。价格跌得越多，其他交易者做空的 兴趣就越小。而价格越接近支撑区域，交易者就越有兴趣做多。毕竟，上一次价格离开该 区域（17:12）的速度相当快。
>
> 从 S/R 区域快速移动的价格使其在再次测试时成为更高质量的区域。我们希望它能保持住 。
>
> 如果交易者在此轮下跌过程中姗姗来迟，做空的几率非常低。
>
> 最终的结果是，这种情况下的价格走势（减速）证实了价格向下波动的疲软；并增加了支 撑区域保持不变的可能性。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061548513.png)

### 7.1.5案例4

> 下图
>
> 展示减速概念，不过这次涉及的是价格在进入阻力区后的上升波段减速。
>
> 减速表明看涨势头逐渐减弱，因为看跌压力战胜了任何看涨压力。
>
> 在此波动后期买入的交易者再次进行了赔率极低的交易。更聪明的交易者已经发现了阻力 位的弱点，因此会寻找机会做空，以便从输家的订单流中获利。
>
> 当然，我们现在还不考虑交易，只是确定强弱迹象。
>
> 在过去的两个例子中，我们已经证明了这样一个概念，即价格减速进入支撑或阻力区域 表明价格疲软，而该价位很有可能支撑住价格。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061552134.png)

### 7.1.6案例5

> 下图
>
> 显示了 D 波段的加速；这是强势的标志。但首先让我们看看之前的价格走势。
>
> 对比波动 A 和波动 C，我们可以看到，由于斜率减小，看跌势头正在减弱。
>
> 波段 D 最初显示出与波段 B 相当的动量，但在突破波段高点 E 之前加速
>
> 这种价格加速显示了看涨方向的力量。
>
> 与加速的看涨波段 D 相比，接下来的回调 F 显示出疲软。
>
> 强势明显是看涨方向，弱势明显是看跌方向。未来的价格走势很可能是顺势走强，逆势走弱。
>
> 但是，极端气候高潮又是怎么回事呢？

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061554381.png)

### 7.1.7案例6

> 下图
>
> 加速的价格波动代表着极端的情绪。看涨的压力大大超过看跌的压力， 因为每个人都在追逐越来越高的价格，急于在错过他们认为有保证的利润之前进入这个市 场。
>
> 这种类型的走势通常与价格柱范围不断扩大和成交量远大于平均水平有关。
>
> 虽然这明显显示了加速期的优势，但这种走势的本质是，它一直会加速到衰竭点，在这个 点上，没有人急于做多，也没有人愿意支付更高的价格。
>
> 波段高点就会形成一个阻力区。如果没有人愿意支付更高的价格，那么价格就无法反弹。 阻力最小的路径就是下跌。市场将在衰竭点之后表现出疲软。
>
> 有时，这些高潮走势会导致非常迅速的反转。价格下跌会触发追踪止损；价格进一步下跌 又会触发更多止损；如此反复。
>
> 其他时候，在反转之前会重新测试衰竭点（在此过程中会创造一个绝佳的交易机会）。
>
> 不过，至少应该预期价格会形成 S/R，至少在可预见的未来会阻挡住价格，就像本例中发 生的那样。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061604291.png)

### 7.1.8案例7

> 下图最后一个例子，包括查看较低的时间框架图，以确认和微调我们的分析...
>
> 低时间框架图的数据与交易时间框架图完全相同。不过，它允许您放大价格走势，以便更 近距离地观察。有点像交易时间框架行动的显微镜。
>
> 在整个分析过程中，都会对较低的时间框架图表进行监控，但在某些关键时刻，会格外关 注该图表。例如
>
> 1.在交易时间框架（3 分钟）内无法获得明确信号时，例如在横向拥堵区域内。 
>
> 2.当价格处于关键决策点时--如突破波段高点/低点。 
>
> 3.当价格处于交易设置区域时。
>
> 下图
>
> 显示的是我们的交易时间框架（3 分钟）图表，市场已经减速进入价格横盘区域（ 蓝色方框所示）。这种横盘走势是潜在反转的迹象吗？还是仅仅是继续前的停顿？

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061608649.png)

> 放大到较低的时间框架（1 分钟），我们可以更清楚地看到价格波动中的动量变化。
>
> 在较低的时间框架（1 分钟）上，我们可以清楚地看到，看涨势头在每次上升过程中都在 减弱，从 A 到 C 再到 E 的波动斜率不断下降就是证明。
>
> 我们还可以看到下行趋势 B 和 D，它们加速跌至低点，其中 D 比 B 显示出更强的看跌力 量。
>
> 尽管数据并未显示一方主导另一方，但随着看涨势头减弱和看跌势头增强，力量天平正慢 慢从多头转向空头。
>
> 由于空头最终压倒了剩余的看涨压力，波动 F 恢复了交易时间框架（3 分钟）的下降趋势 。
>
> 从供需角度看，
>
> 每次价格波动都表明需求减少，供应增加。在没有任何外部因素引入新需 求的情况下，供应很可能会耗尽所有需求，迫使价格下跌。 
>
> 从交易者及其决策过程的角度来看
>
> 这次市场减速提供了一些诱人的多头入场机会，吸引了许多希望在反转中及早入场的交易 者。入场机会有很多，但为了简单起见，我们只考虑一类人--那些错过了 A 点反弹的人， 他们对错过如此明显的入场机会感到非常沮丧，然后欣喜若狂地看到了 C 点的第二次入场 机会。在 C 波段入场时，价格横盘了 10 分钟左右，然后加速下跌，这让他们非常沮丧。 有些人会在 D 波段止损，因为它突破了 C 波段的低点。其他人则会继续持有，起初他们 会感到恐惧，但当 E 波段使他们重新获利时，他们又会如释重负（可能还会有一丝满足 感，因为他们知道在下跌过程中继续持有是多么明智）。
>
> 这些交易者无法通过简单的动量分析发现明显的疲软迹象。
>
> 当看跌力量压倒看涨压力时，市场就会崩溃，引发这些非常沮丧和愤怒的多头止损。
>
> 作为永利国际娱乐平台价格行为交易者，我们的目标是从这些亏损交易者身上获利。认识 到强势转为看跌后，我们就有机会顺势做空，从而从试图顺势交易的亏损者的订单流中获 利。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061612684.png)

### 7.1.9总结

> 并非每次价格波动都能通过动量分析提供有用信息。不过，我们会在价格波动时监测动量 ，以注意任何重大变化。这些变化可能表现为从一个波段到另一个波段的速度变化（斜率 变化），或一个价格波段内的速度变化（加速或减速）。
>
> 1.将当前价格波动的动量与之前同方向价格波动的动量进行比较？价格比之前是快了 还是慢了？这意味着什么？
>
> 2.将当前价格波动的动量与之前价格波动的动量进行反向比较？价格比之前是快了还 是慢了？这意味着什么？
>
> 3.当前的价格是加速还是减速？这意味着什么？
>
> 注意到这些变化，我们从供求关系的角度和交易者做出交易决策的角度来思考其意义。
>
> 动量分析能让我们感知趋势中价格波动的强弱变化，从而评估趋势本身的强弱。
>
> 价格走势很可能会继续向强势方向发展，而与任何弱势方向相反。
>
> 这种评估趋势增强或减弱的能力，使我们比那些看不到这些信息的交易者更有优势，尽管 这些信息就公开摆在他们面前。

## 7.2投影

> 趋势的加强或减弱也可通过分析投影和深度结果来观察。
>
> 投影是指价格延伸超过前一个波段高点（在上升趋势中）或波段低点（在下降趋势中）的 距离。
>
> 下图
>
> 上升趋势，我们可以看到价格走势显示了三个价格延伸段 E1、E2 和 E3 。每个延长线的投影显示为 P1、P2 和 P3。P1 是 E1 超出前一个波段高点的距离。P2 是  E2 超出前一个波段高点的距离。P3 是 E3 超越前一个波段高点的距离。
>
> ==重要的信息并不在于距离，而在于比较一个投影和下一个投影时的变化。==
>
> 请注意，与 E1（P1）相比，E2（P2）的延伸范围更大。延伸段 E2 比 E1 延伸得更远，表 明趋势的强度更大。 然后，P3 比 P2 短得多，表明趋势正在变弱。
>
> 下降趋势也显示了类似的信息。投影 P4 是延长线 E4 穿过前一个波段低点的距离。P5 和  P6 依此类推。
>
> P5 显示的距离大于 P4，表明下降趋势增强。P6 显示的投影比 P5 减小，表明下降趋势可 能减弱。
>
> 投影增加是潜在趋势走强的迹象。投影值减小则表明潜在趋势减弱。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061618435.png)

> 下图
>
> 投影 A 是指延伸 A 穿过前一个波段高点的距离。在这种情况下，投影值相当于整个 A 延伸 段的 45%。
>
> 投影 B 是指延伸 B 穿过前一个波段高点的距离。在这种情况下，投影值相当于延伸 B 范围 的 52%。
>
> 投影 C 是指延伸 C 超越前一个波段高点的距离。在这种情况下，投影值仅相当于扩展 C 范 围的 25%。
>
> 在进行分析时，您不必计算百分比。我们关注的不是预测的绝对值，而只是寻找视觉上明 显的变化。
>
> 在这个例子中，延伸段 A 和 B 很容易突破并创出新高。但延伸段 C 却无法达到同样的距 离。供需平衡发生了变化。如果与之前的情绪相比没有变化，那么延伸段应该与之前的距 离大致相同。市场无法做到这一点，表明看涨压力减小和/或看跌压力增大。
>
> 上升趋势有减弱的迹象。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061705112.png)

## 7.3深度

> 深度是指回调与前一个延伸段之间的距离。
>
> 下图
>
> 上升趋势，我们可以看到三个延伸段 E1、E2 和 E3。
>
> 深度 D1 是回撤到 E1 的距离（以百分比而不是价格值来计算）。
>
> D2 是回撤至 E2 的深度。D3 是回调延伸 E3 的深度。
>
> 与预测一样，我们对深度的绝对值并不十分感兴趣；相反，我们注意到深度从一个价格波 段到另一个价格波段的显著变化。
>
> 请注意，与 D1（约 40%）相比，D2 在其延伸部分 E2（约 20%）中所占的比例要小得多 。D2 的深度小于 D1，这表明空头可能会减弱，因此价格趋势会走强。
>
> 请注意，D3 明显大于 D2，这表明空头中的潜在力量，因此也表明价格趋势中的潜在弱点 。
>
> 同样的概念也适用于下降趋势。
>
> 与 D4 相比，D5 的深度大大降低（请记住，我们将 D5 占 E5 的百分比（约 20%）与 D4  占 E4 的百分比（约 60%）进行比较）。在下降趋势中，回撤深度减小是多头潜在疲软的 迹象，因此也是下降趋势潜在走强的迹象。
>
> D6 显示的深度百分比比 D5 大得多，这表明多头的潜在力量很强，因此趋势也可能很弱。
>
> ==深度增加表明潜在趋势减弱。深度减小则表明潜在趋势走强。==

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061709585.png)

> 下图
>
> 深度 A 是指回调幅度与延伸段 A 的回调幅度的百分比。
>
> 深度 B 是指回调幅度与延伸段 B 的回调幅度的百分比。
>
> 在这种情况下，深度 C 是指回撤相当于扩展 C 范围 85% 的回撤。
>
> 与预测分析一样，我们关注的不是绝对数量，而是在比较当前波段和之前波段时，观察深 度内的变化。
>
> 回调深度 C 的增加表明看跌压力在增加，趋势有可能减弱。
>
> 假设 38% 的回撤是浅回撤，50% 的回撤是正常回撤，62% 的回撤是极端回撤是错误的。 回撤的深度应被视为正常，这取决于当前的市场环境。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061714831.png)



> 下图
>
> 在波动的趋势环境中，深度回调可能是常态
>
> 在这一趋势中，65%-75% 的回撤深度被认为是正常的。只有当回撤深度（PB3 和 4）超过 其延伸长度时，趋势才会减弱。这是力量平衡转向看跌一方的明显迹象。趋势有明显的结 束迹象。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061716398.png)

### 7.3.1总结

> 通过分析，我们要寻找的是一些已经发生变化的证据--更浅或更深的回撤或延伸。如果市 场情绪一如既往，那么回撤或延伸就会与之前的回撤和延伸保持一致。市场发生变化这一 事实表明情绪发生了变化。分析这种变化--从供需角度看意味着什么？从其他交易者及其 决定、想法和情绪的角度来看意味着什么？
>
> 虽然通过动量分析，这些变化往往显而易见，但并非总是如此。在许多情况下，分析预测 和深度是发现价格走势中情绪变化的最简单方法。

## 7.4无力继续

> 与动量和投影/深度密切相关的一个概念，我称之为 "无力继续"。
>
> 你经常会在图表上看到一些形态，这些形态（在不明真相的人群中）会对未来的价格走势 产生明显的预期。当未来价格走势未能达到预期时，市场就会为我们提供相关价格趋势强 弱的线索。
>
> 下图
>
> 在受到基本面影响的强劲下行脉冲和较弱的回调之后，人们显然期待着继续下行，突破新 低。
>
> 如果达不到这一预期，则表明看跌方向疲软。
>
> 通过对价格波动势头的分析，或对预测和深度的分析，可以很容易地观察到这种弱点。然 而，观察这种疲软的最简单方法往往是通过简单的未能达到预期或无力继续。 如上例所示，"未能继续 "不仅包括未能突破高点或低点。它也可能表现为突破该水平后迅 速失败。
>
> 任何时候，如果明显的预期未能持续，市场就会给你一个强有力的线索，告诉你 未来趋势方向。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407061721313.png)

## 7.5未来趋势方向的原则

> 在分析了过去的趋势方向并确定了该趋势中的强弱迹象后，我们现在要做的就是确定未来 可能的趋势方向。
>
> 趋势中的强弱迹象会提醒我们，当趋势不适合我们的时候，通过反趋势修正或反转可以获 得更高的概率。
>
> 评估未来可能的趋势走向的原则：
>
> ==在 S/R 框架内：==
>
> 第一条原则 - 除非趋势中出现疲软迹象，否则我们预期上升或下降趋势将继续保 持当前状态，直至下一个 S/R 障碍。
>
> 第二项原则--当上升或下降趋势出现疲软迹象时，我们预计出现复杂修正*而非反 转的可能性较高，直到市场显示出对新趋势方向的价格认可和力量。(复杂校正是指持续时间较长或多次波动的校正）。
>
> 第三项原则--除非有证据表明趋势在向区间边界发展，否则框架内的横向趋势将 继续保持目前的状态。
>
> 第四项原则--当横向趋势显示出向区间边界走强的迹象时，我们预期会突破该边界 。我们会观察突破后的价格走势，以寻找未来方向的线索：
>
> 1.突破后的疲软--预期突破失败，反转回到交易区间内 
>
> 2.回调无力--预期是突破性回调和延续
>
> ==在 S/R 框架的边缘：==
>
> 第五项原则--除非在接近 S/R 边界时表现出优势，否则我们期望对我们的框 架 S/R 进行测试。
>
> 第六项原则 - 如果在接近 S/R 障碍时出现强势，我们就会期待突破，并观察突破 后的价格走势，以寻找未来方向的线索：
>
> 1.突破后的疲软--预期突破失败，并通过 S/R 区域反转。
>
> 2.回调无力--预期是突破性回调和延续。

### 7.5.1原则1

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071136836.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071137232.png)

### 7.5.2原则2

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071137251.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071137294.png)

### 7.5.3原则3

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071138307.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071138510.png)

### 7.5.4原则4

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071138311.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071139483.png)

### 7.5.5原则5

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071139843.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071139519.png)

### 7.5.6原则6

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071139433.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071141785.png)

### 7.5.7总结

> 这仅仅是初步评估
>
> 保持简单，不要过于紧张，以免出错。随着图表右侧更多价格走势的展开，我们将很快逐 条更新我们的评估。
>
> 你很快就会知道自己是否判断失误，因为新的强弱迹象会证实或否定你之前的评估，并为 你提供更新未来趋势评估的机会。不过，为了让这一切变得更容易，将未来形象化......

## 7.6验证评估纠错趋势

> 在确定了我们对未来趋势方向的偏向之后，我们很快就会随着市场打印出新的k线来重新评估我们的偏向。新的数据是会确认我们的偏向保持不变，还是会提供一些 新的信息，提醒我们注意供需关系中的潜在变化？
>
> 为了便于评估，我们应该对未来的订单流量有一定的预期。
>
> 这只是一个考虑以下问题的过程：
>
> 1.什么样的价格走势可以验证您对未来趋势的评估？
>
> 2.哪些价格走势会使您对未来趋势的评估失效？
>
> 下图
>
> 我 们预计横盘趋势将持续。
>
> 怎样的价格走势才能验证我对未来趋势方向的评估？
>
> 脱离支撑位的大范围看涨绿色k线图应会导致开始向阻力位回升。我预计会出现进一步 的跟进上行，势头放缓后会进入阻力位，就像早些时候向图表左侧上行时发生的情况一 样。脱离支撑位的多头交易者将瞄准上方阻力位。他们的卖单以及在该区域进入的空头 应该足以守住价格，防止进一步反弹。
>
> 哪些价格行为会使我对未来趋势方向的评估失效？
>
> 如果价格无法突破，并跌破最新的绿色看涨k线，我就需要重新评估倾向。看跌压力 可能比预期的要大，是时候考虑向下突破的可能性了。这种情况会让持有多头头寸的人 感到震惊，如果低点被跌破，他们就会准备快速离场，从而增加看跌压力并帮助突破。 现在，我已经为未来的价格走势做好了准备--如果我对未来趋势的评估是正确的，我知道 价格走势应该是什么样子；如果我的分析是错误的，我也知道价格走势会是什么样子。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071622454.png)

> 下图
>
> 价格第二次突破了阻力位。这第二次突破虽然最初很弱，但现在显示出了 力量。这可能表明价格接受了突破区域，我预计突破将得以保持并继续走高。
>
> 怎样的价格走势才能验证我对未来趋势方向的评估？
>
> 尾部上方显示出一些供应迹象。我预计在接下来的一两根k线图中会出现回调。但是， 回调必须通过浅斜率（看跌动能减弱）和/或深度减小来显示疲软。
>
> 哪些价格行为会使我对未来趋势方向的评估失效？
>
> 回调时的强势将表明供应会以这些较高的价格进入市场。如果出现这种情况，那么第二次 突破时的强势很可能只是止损被触发，市场还没有吸引到足够的新多头来支持继续突破。 如果出现强势回调，我将重新考虑我的预期，如果跌破绿色突破大阳线，则确认突破失败 。
>
> 正如你所看到的，可视化只是一个简单的过程，询问你期望在不久的将来看到什么。我们 不会固守这个观点--事实上，我们甚至会 考虑什么样的价格走势会使我们的计划失效，一旦发现它不再适合当前的市场，就随时准 备放弃。 这一过程只是经验的积累。我们将提供更多实例，涵盖整个分析过程。不过，真正的学习 将发生在你分析图表的过程中。随着您在屏幕上的时间越来越多，您阅读市场和准确评估 未来订单流（并实时更新评估结果）的能力也会提高。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071716730.png)

## 7.7原则56说明

> 成功测试（第五项原则）或成功突破失败（第六项原则）之后会发生什么？
>
> 价格是否有望立即反转并改变趋势？
>
> 还是我们期待趋势保持不变，并再次测试 S/R？
>
> 我认为 S/R 是趋势的障碍。它们提供了一些反趋势订单流，但在我们看到可能（或确认） 反转的证据之前，并不能自动认为它们会扭转趋势。
>
> 反转的证据显然需要价格接受趋势变化点；这是新趋势方向强劲的标志。
>
> 当我们看到价格波动在反转方向上表现出明显的强势，而在原来的趋势方向上表现出弱势 ，即使价格还没有超过趋势变化点，这就是可能发生反转的证据。
>
> 在看到这些迹象之前，我们认为趋势将占上风，并将再次测试或尝试突破。
>
> 因此......在成功测试或突破回调之后......我们要观察价格走势，寻找牛市或熊市哪一方表现 出更强势的线索。强势或弱势的迹象将提醒我们未来可能的趋势方向。 
>
> 如果在一段时间内我们有点不确定......那就这样吧。在这种情况下，我的建议是始终相信 趋势。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071720014.png)

> 让我们从一个稍有不同的角度来讨论这个问题，我会尽量说得简单一些。
>
> 在趋势没有走弱的情况下（当测试过 S/R 时），预期趋势将继续（第一原则），这 将使我们再次测试 S/R（第五或第六原则）。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071722941.png)

> 如果趋势出现疲软（测试了 S/R），但没有迹象表明反转方向强劲，则在再次测试  S/R（第五或第六原则）之前，预计会出现复杂的回撤（第二原则）

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071723640.png)

> 如果逆势走强，则有望出现反转。在这种情况下，任何对 S/R 的回测都可视为 新趋势方向上的回调（第一原则）。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071723481.png)

> 后 S/R 区域有时会让人有些困惑。有时需要经过一两次价格波动才能弄明白。但请记住 ......您将逐条更新您的评估。只要做出最好的评估就可以了，因为如果你判断错误，你很 快就会知道，并且能够调整你的偏差。 如果有任何疑问，请始终相信趋势，直到趋势被打破。

# 8.0市场分析流程

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071724181.png)

## 8.1确定结构

> 确定一个结构框架，在此框架内，我们的交易时间框架价格行动将发生变化。
>
> 操作：
>
> 确定较高时间框架（30 分钟）图表上的支撑或阻力区域
>
> 确定波段高点和低点

## 8.2确定趋势

> 在我们的市场结构框架内评估过去的价格走势。
>
> 操作：
>
> 在交易时间框架（3 分钟）图表上识别重要的波段高点和低点。
>
> 确定趋势方向，向上、向下或横向

### 8.3确定优势和劣势

> 分析趋势中的价格走势，找出强弱迹象。
>
> 操作：
>
> ==分析近期价格波动的动量：==
>
> 1.将当前价格波动的动量与之前同方向价格波动的动量进行比较？价格比之前是快了还是慢了？这意味着什么？ 
>
> 2.将当前价格波动的动量与之前价格波动的动量进行反向比较？价格比之前是 快了还是慢了？这意味着什么？
>
> 3.当前的价格是加速还是减速？这意味着什么？
>
> ==比较近期价格波动的预测和深度==
>
> 1.预测增加是潜在趋势走强的迹象。预测值减小则表明潜在趋势减弱。
>
> 2.深度增加表明潜在趋势减弱。
>
> 3.深度减小则表明潜在趋势走强。
>
> ==确定未能继续的迹象（即未能达到预期目标）。==
>
> 不继续是趋势弱的表现
>
> ==通过各种方法找出优势或劣势的迹象==
>
> 容量分析 市场 内部指标

## 8.4确定未来趋势方向 未来价格走势

> 根据以下六项原则，确定未来价格走势的可能路径：
>
> ==在 S/R 框架内：==
>
> 第一条原则 - 除非趋势中出现疲软迹象，否则我们预期上升或下降趋 势将继续保持当前状态，直至下一个 S/R 障碍。 
>
> 第二项原则--当上升或下降趋势出现疲软迹象时，我们预计出现复杂 修正而非反转的可能性较高，直到市场显示出对新趋势方向的价格认 可和力量。 
>
> 第三项原则--除非有证据表明趋势在向区间边界发展，否则框架内的 横向趋势将继续保持目前的状态。 
>
> 第四项原则--当横向趋势显示出向区间边界走强的迹象时，我们预期 会突破该边界。我们观察突破后的价格走势，以寻找未来方向的线索 ： 
>
> 1.突破后的疲软--预期突破失败，反转回到交易区间内 
>
> 2.回调无力--预期是突破性回调和延续。
>
> ==在 S/R 框架的边缘：==
>
> 第五项原则--除非在接近 S/R 边界时表现出优势，否则我们预计将对 我们的框架 S/R 进行测试。 
>
> 第六项原则 - 如果在接近 S/R 障碍时出现强势，我们就会期待突破， 并观察突破后的价格走势，以寻找未来方向的线索：
>
> 1.突破后的疲软--预期突破失败，并通过 S/R 区域反转。
>
> 2.回调无力--预期是突破性回调和延续。

## 8.5预测未来价格走势

> 您预计价格将如何波动？根据您对未来趋势方向的预期及其与市场结构 S/R 水平的相互作 用，设想未来的价格走势。
>
> 操作
>
> 1.什么样的价格走势能验证您对未来趋势方向的评估？ 
>
> 2.哪些价格走势会使您对未来趋势方向的评估失效？

## 8.6确定交易机会领域

> 

## 8.7案例

> 步骤 1 - 确定结构
>
> 我在上图中标出了支撑区和阻力区，以确定市场结构。
>
> 请注意，我在进行自己的分析和交易时，通常不会给 S/R 水位标注名称。这样做是为了在 本示例中更容易参考 S/R 水位。 
>
> 价格下方的支撑位（Spt A）在 1.5560 附近，由上一交易日亚洲时段的低点构成。 
>
> 进一步的支撑位在前一交易日美国时段低点 Spt B（1.5505）和前一交易日英国时段低点  Spt C（1.5440）。
>
> 我将 Res A 阻力位设在 1.5625。虽然这还不符合波段高点的定义（因为在波段高点右侧只 有一根较低的阳线高点），但它是亚洲时段的高点，因此将是一个潜在的重要水平。 
>
> 市场一直处于较长时间段的上升趋势中（至今已有两个月），因此 30 分钟图表没有显示 更高的阻力位；下一个日线图阻力位在 1.5820 之前。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071733107.png)

> 步骤 2 - 确定趋势
>
> 交易时间框架（3 分钟）（下图 3.99）显示，近期从上升趋势转为下降趋势，因为波动低 点 B 在波动低点 A（Res A 最高点之前的最后一个波动低点）下方形成。
>
> 波动低点 B 之后是较低的高点 C，现在价格已跌破 B。经典的低点和低点！
>
> 市场正处于下降趋势中。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071735580.png)

> 交易时间框架（3 分钟）上的动量分析（下图 3.100）显示，通过波段（a）的较强动量和 波段（b）的较弱动量，最初的力量偏向看涨。
>
> 然而，此后市场情绪发生了变化。对比（a）与（c）和（e）的波动，可以看出看涨势头 有所减弱。将(b)与(d)和(f)进行比较，可以看出看跌势头明显增强。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071735288.png)

> 下图所示的较低时间框架（1 分钟）图表证实了这一点，
>
> 其中看跌波动（d）和（f ）都比看涨波动（c）和（e）更强。 这就将强势置于看跌一方，弱势置于看涨一方

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071736377.png)

> 但值得注意的是，与深度更大的 D1 相比，P1 和 P2 的预测更为薄弱，如图 3.102 中交易时 间框架（3 分钟）所示。
>
> 看似矛盾，但这在当天主要交易时段开盘前并不罕见。 
>
> 力量偏向看跌，但幅度不大。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071737173.png)

> 步骤 4 - 确定未来趋势方向
>
> 目前，价格走势并未接近我们的任何 S/R 水平。趋 势是下跌。
>
> 尽管没有显示出很大的力量，但力量也仍然是向下的。我的预期符合未来 趋势方向的第一原则：
>
> 第一条原则 - 除非趋势中出现疲软迹象，否则我们预期上升或下降趋势将继续保持 当前状态，直至下一个 S/R 障碍。
>
> 我的预期是价格继续保持目前的趋势状态，直至到达位于或大约位于 1.5560 的 Spt A 区 域

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071737494.png)

> 步骤 5 - 预测未来价格走势
>
> 我如何预期未来的价格走势？怎样的价格走势才能验证这一分析？
>
> 1.我们需要看到在看跌波动中继续走强，在看涨波动中继续走弱。
>
> 2.英国时段的开盘至关重要。它可能导致短期波动。任何在开盘时推高的走势都应迅 速遭到强烈拒绝，并且不应突破上一波段的高点。
>
> 什么样的价格走势会使这一分析失效？
>
> 如果市场在开盘时表现出持续的强势，尤其是突破上一个波段的高点，则需要进 一步分析。
>
> 这里需要注意的重要一点是，外汇交易时段的开盘往往是进行分析的困难时刻（任何其他 工具的开盘也是如此，如每日 emini 期货开盘）。随着新交易者开始做多或做空，波动性 会在短时间内急剧增加。有些交易者会在交易时段的前五分钟左右置身事外，让价格决定 其正确方向。无论如何，我更愿意进行分析，以便为开盘几分钟内出现的任何交易机会做 好准备，但我总是会更加谨慎。 
>
> 但在这个例子中，情况相当简单。任何向低价位的推进都很容易守住其水平，因为会前多 头会触发止损，从而增加看跌订单流。在突破 Res A 以上的新高之前，任何冲高都不会受 益于额外的 "止损 "订单流。因此，冲高应该很快失败，否则就会提供潜在新买盘（看涨 力量）的证据，因此需要重新评估我的分析。 
>
> 应在会前进行分析，预计可能出现的短期波动，并考虑如果出现这种波动，谁会被套牢和 /或止损。
>
> 请记住--我们目前进行的分析只是我对未来可能趋势走向的初步评估。随着新数据的出现 ，我将逐条更新这一评估。因此，如果我错了，我会及时看到，以便重新评估和调整我的 预期。如果我是对的，我就会做好准备，在价格沿着我的预期轨迹运行时，抓住任何交易 机会。

# 9.0k线分析

> 我们的初步分析得出了对未来趋势方向的初步评估。随着图表右侧更多价格走势的展开， 持续分析需要逐条重新评估我们之前的分析。
>
> 新的数据会一个蜡烛一个蜡烛地到来。每根新蜡烛都是一个信息源；其中大部分不会提供 任何新信息或相关信息；但有些会改变我们的分析，加强或削弱我们对市场情绪和未来价 格走向的评估。
>
> ==每一根新蜡烛都可能意义重大。==
>
> 如果不对每根新蜡烛的价格进行监控，就意味着我们将被迫做出反应--对价格走势的发展 感到惊讶，并在价格走势变得明显之后追逐设置和入场机会。
>
> 持续监控可确保我们保持专注，保持对形势的认识--领先于当前的价格走势--评估其可能 的走向，这将如何影响其他交易者的决策，以及这将在哪里创造交易机会。
>
> 持续的价格走势分析可以在所有时间框架内进行，但我们主要关注的是交易时间框架。我 们质疑每一根蜡烛，以确定它对牛市和熊市之间的情绪变化意味着什么，以及是否会改变 我们对未来的预期。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071741727.png)



## 9.1k线走势

> 所有多头k都看涨，但根据其收盘位置（高位、中位或低位）的不同，看涨情绪略有不同。
>
> 所有都是中性的，但根据其收盘位置（高位、中位或低位），情绪略有不同 。
>
> 空头k也是如此，虽然根据收盘位置（高位、中位或低位）的不同，情绪略有不同，但都是 看跌的。
>
> 我们通过观察最新蜡烛的以下特征来进行分类： 
>
> 1.近似比较 
>
> 2.收盘位置

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071742984.png)

## 9.2收盘位置

> 收盘位置允许我们判断单根k线的情绪。
>
> 我们将k线定义为 "高位收盘k线"、"中位收盘k线 "或 "低位收盘k线"，具体取决于 价格在高低区间内的收盘位置

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071744040.png)

> 高位收盘k线图是指收盘价位于k线范围上部三分之一的k线。
>
> 下图 
>
> (a) 至 (f) 展示了高位收盘k线。请注意，所有k线都在上三分之一处收盘。
>
> ==高位收盘k线在该k线期间显示出看涨情绪。==但是，您会注意到每根k线中看涨的程度不 同。例如，比较（a）和（b），我们会发现（b）能够从开盘价开始推动价格上涨，几乎 没有受到熊市的阻力，而（a）最初从开盘价开始下跌，然后才能够反弹走高。k线（a ）可能比k线（b）更不看涨。
>
> 从(a)到(f)，所有这些k线都看涨；只是看涨的程度略有不同。
>
> 中位收k线线是指收盘价位于k线线范围中间三分之一的k线线。
>
> （g ）至（l）展示了中位k线的示例。
>
> ==收盘中阳线的情绪被认为是较为中性的==，因为价格在收盘前曾走高或走低，最后收于中间 区间。
>
> 请再次注意k线之间情绪的细微差别。虽然所有k线都是中性的，但例如(i)与(l)相比，(i) 更偏向于中性看涨，而(l)则偏向于中性看跌。 
>
> 低位收盘k线图是指收盘价位于k线范围下三分之一的k线。
>
> （ m）至（r）是低位收盘k线的示例。
>
> ==地位收盘k线的情绪是看跌的。==请再次注意情绪上的细微差别。虽然所有k线都显示看跌情绪 ，但例如k线（m）只能实现窄幅震荡，而k线（o）则显示出巨大的看跌压力，促使价 格大幅下跌。
>
> 根据收盘位置对k线进行观察和分类，可以快速评估该k线的情绪--看涨、中性或看跌。 价格在k线中的运行轨迹会导致看涨/中性/看跌情绪程度的细微变化。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407071747695.png)



## 9.3近似对比

> 我们将一根k线定义为 "多头k"、"区间k "或 "空头k"，具体取决于价格相对于前一根k线的 收盘区间。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407072256634.png)

> ==多头k是指收盘价高于前一根k线区间(实体)高点的k线。==
>
> 下图的（a）至 （c）说明了这一点。请注意，所有三根k线的收盘价都高于前一根k线的高点。多头k被 视为显示看涨情绪。
>
> ==区间k是指在前一根k线的区间(实体)内收盘的k线。==
>
> 下图中的(d)至(f)就说明了这一点。 请注意，所有三根k线都在前一根k线的范围内收盘。区间蜡烛图被视为显示中性情绪。 
>
> ==空头k是指收盘价低于前一个k线区间(实体)低点的k线。==
>
> 下图中的(g)至(i)就是证明。请注意 ，所有三根k线的收盘价都低于前一根蜡烛的低点。熊烛被视为显示看跌情绪

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407072257225.png)

## 9.4确定形态分类和观点

> 让我们来判断一下最新 2 个k线图的情绪。出发点很简单。我们看收盘价对比：
>
> 多头k = 看涨的双k形态情绪
>
> 区间k = 中性的双k形态情绪
>
> 空头k= 看跌的双k形态情绪
>
> 然后将考虑收盘位置（单一k线形态），以确定看涨或看跌的不同程度。
>
> 下图
>
> 虽然（a）至（c）都显示出多头k，因此也显示出看涨形态的情绪，但每个k线的 看涨程度各不相同，这一点在将收盘位置添加到形态定义中时就很明显了。
>
> k线（a）是我所说的高位收盘多头k。高位收盘和多头k成分都代表看涨。这两者结合在一 起，表明了强烈的看涨情绪。 
>
> 比较一下（a）与（b），（b）显示的是中间收盘的多头k。价格再次收于前一根k线之上，但这次是 中性收盘。虽然仍然看涨，但情绪不如示例（a）看涨。 
>
> 在（c）中，我们看到一根低位收盘的多头k。是的，它收于前一个高点之上，但更高的价 格明显被拒绝，导致价格收于上一根k线的低点附近。我们看到看涨情绪（多头k）与看跌 情绪（低位收盘）相结合。这是一个微弱的看涨走势。 
>
> 将我们的平仓分析与 "多头k "结合起来，就能得出不同程度的看涨信号。 
>
> 同样的概念也适用于我们的区间k，上文的示例（d）至（f）就是证明。区间蜡烛本 身意味着中性情绪，但通过同时考虑收盘位置，我们可以更深入地了解这种中性情绪的不 同性质。 
>
> 以（d）为例，我们可以看到一根高位收盘范围k线。最新的k线是一根高位收盘k线， 收盘价正好位于高点。单看这根k线似乎看涨，但与前一根k线相比，我们会发现高位收 盘k线只是回调了大约 50%。 的前一根强烈看跌的低位收盘k线。综合来看，这可能略微偏向中性看跌。 
>
> 同样，示例（f）是低位收盘范围k线；这种组合更偏向于中性看涨。 而示例（e），即中收盘范围k线，显然是中性的，价格现在两次测试较高和较低的位 置，然后在接近两根k线的中间范围时稳定下来。双方都没有显示出优势。 
>
> 空头k是指收盘价低于前一根k线的低点。从表面上看，这听起来像是看跌，但如果同时考 虑我们的平仓分析，看跌的程度会有所不同。 示例(i)是一个低收盘空头，显示了极度看跌的情绪，因为收盘位置和收盘比较成分都暗 示看跌。 
>
> 与例子（g）相比，高位收盘空头明显拒绝了较低的价格，并在高位收盘。仍然看跌，但 显示出一些看涨订单流的迹象，与我们的看跌情绪相反。这种双k线形态显示了微弱的看 跌情绪。 而示例（h）则介于两者之间，显示了中收盘空头。我们再次看到一些看涨订单流将价格 推离低点，与我们的看跌情绪相反，但程度比示例（g）要轻一些。 下一步......结合当前的市场价格走势，考虑我们的双k线形态情绪。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407072257225.png)

## 9.5三根k线走势

> 比较前三根k线的收盘价，开盘价，最高价，最低价。
>
> 当前价格对前三根或者更多k线的同等价格的空头，他们的心理是什么，舒服/着急
>
> 当前价格对前三根或者更多k线的多头，他们的心理是什么，舒服/着急
>
> 如果是上升趋势，当前k线的价格如果与前面的第三根k线的价格持平，那么那么第三根后面的上升时做的多单都不好受，因为价格冲高回落，本来有盈利的被打平了，甚至可能会亏损，最后一批被套的多头更难受
>
> 对比才能看出哪边更强
>
> 当前价格对比前三根k线动能，更大，更小，不变

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407251454617.png)



## 9.5总结

> 持续的价格行为分析过程始于确定当前蜡烛形态的情绪。我们通过分析适用于该形态的收 盘位置和收盘比较来实现这一点。
>
> 正如前面的示例所示，这是一个快速的过程，耗时不会超过几秒钟。
>
> 它能让我们感受到当前蜡烛形态的短期情绪。谁在控制价格--牛市还是熊市？他们控制的 程度如何？ 
>
> 一旦确定了整个流程，基于图表的示例很快就会出现。

# 10.0背景

> 考虑背景 "意味着我们要考虑当前价格形态与背景市场环境和价格走势的关系，以及这意 味着什么。
>
> 下图
>
> 我们可以看到左侧的低位收盘范围k线是在上升趋势减弱后进入阻力 区域后出现的。第一根看涨k线突破了近期的价格走势，并在阻力区域穿透了几个点，然 后被拒之门外。如果跌破这根k线，被套牢的多头就会出局。虽然低位收盘区间k线一 般被认为显示中性情绪，但如果我们考虑到该形态的位置，它就具有合理的看跌含义。
>
> 与右侧的低位收盘区间k线图相比，该k线出现在窄幅横盘的中间位置。在这个位置出 现这种形态，完全没有迹象表明市场情绪可能发生任何变化。这显然是中性的。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080123856.png)

## 10.1背景原则

> 我主要看价格与三个主要方面的关系--
>
> 1.S/R 结构中 的位置、
>
> 2.趋势中的位置，
>
> 3.以及关键波动高点或低点的位置。
>
> 通过将该形态置于背景结构和价格走势的背景中，我们最终试图了解它对基本趋势的强弱 有何影响，以及这对我们预期的未来趋势有何影响。
>
> 虽然价格形态的许多要素可以在图表上客观地看到，但判断该形态对未来趋势方向的影响 却纯属主观过程。
>
> 你可以通过质疑图表上的内容来获得这种主观感受。
>
> 价格与 S/R 的关系如何？
>
> 在趋势中处于什么位置？
>
> 与关键波动高点和低点的关系如何？
>
> 这 意味着什么？

### 10.1.1支撑与阻力

> 较高时间框架的支撑位和阻力位在哪里？ 
>
> 市场在接近 S/R 区域时表现出的是强势还是弱势？
>
> 目前的k线形态是否延续了这种 强势或弱势，还是发生了什么变化？ 
>
> 该形态是否显示出订单流反对进入 S/R 的迹象，例如尾部在 S/R 水平或附近拒绝价 格？ 
>
> 形态是否突破了 S/R 区域？如果是，现在是否显示出接受或拒绝这一新区域的迹 象？ 

### 10.1.2趋势

> 1.当前趋势中的模式出现在哪里？ 
>
> 2.是否在延期？是在移动的早期，还是在移动的晚期和过度延伸？是否已经突破了前 一波段的高点/低点？ 
>
> 3.它是在回调吗？是回调初期，还是回调深度超出预期？是单波段回调，还是多波段 回调的一部分？ 
>
> 4.还是该形态处于横盘区间或其他形式的盘整形态中？ 

### 10.1.3波段高点和低点

> 1.价格是否在测试任何波段高点或低点？
>
> 2.尤其重要的是那些导致趋势定义改变的区域 ；价格在这些震荡高点或低点的反应如何？ 
>
> 上升趋势 
>
> 1.应密切关注回调至前期波段低点支撑区域的情况。我们希望它们能保持住。价格走 势是否显示出支撑位的迹象，还是有可能突破？如果跌破，价格是否显示出拒绝迹 象（订单反向流动/难以继续），或者价格是否接受这一新区域？ 
>
> 2.回调至前期震荡高点（上升趋势中）并不那么关键，但仍需注意其反应。 
>
> 3.预计突破前期波段高点。价格走势是否支持这一前提，或者k线形态是否显 示出疲软。如果不能突破前一波段高点，我们就需要警惕进一步的疲软迹象，这可 能预示着复杂的修正或反转。 
>
> 对于下降趋势 
>
> 1.应密切关注前期震荡高点阻力区域的回调。我们希望它们能保持住。价格走势是否 有迹象表明该阻力位将被守住，还是有可能被突破？如果突破，价格是否显示出拒 绝迹象（相反的订单流 /难以继续），还是价格接受这一新领域？ 
>
> 2.回调至前期震荡低点（在下降趋势中）并不那么关键，但仍需注意其反应。 
>
> 3.预计突破前一波段低点。价格走势是否支持这一前提，或者蜡烛形态是否显 示出疲软。如果不能突破前一个波段低点，我们就需要警惕进一步的疲软迹象，这 可能预示着复杂的修正或反转。 
>
> 横向趋势 
>
> 1.价格是否在测试区间边界？ 
>
> 2.市场在接近边界时表现出的是强势还是弱势？当前的蜡烛形态是否延续了这种强 势或弱势，还是发生了什么变化？ 
>
> 3.形态是否显示出订单流反对向区间边界移动的迹象，例如尾部拒绝价格处于或接近 该水平？ 
>
> 4.形态是否已突破 S/R 范围区域？如果是，现在是否显示出接受或拒绝这一新区域 3.5.3 的迹象？

# 11.0预期

> 在考虑了这种模式的情绪，以及它在我们的市场结构中的位置之后，我们现在要问的是， 它是否支持我们的前提？
>
> 所谓前提，是指我们对未来趋势的预期，以及支持这一趋势的价格走势。
>
> 这种模式是否符合我们对未来价格走势的预期？
>
> 1.是的......我们等待着下一根k线。
>
> 2.不......决定是继续持有等待下一根k线，还是从我们的 "初步市场分析 "开始重新 考虑。
>
> 3.不确定......再等等，很快就会有新的k线出现。
>
> 当情况不对时，你就会知道--价格走势会让你大吃一惊。 
>
> 你本以为会缓慢地爬进阻力区，但你会突然看到一股强劲的冲力直冲该区域，并以高点收 盘。 
>
> 当您期待突破某一水平时，您会发现第二次突破该水平失败了。意料之外的疲软！ 预期上升趋势将延续，但下一个价格延伸却停滞在前一个波动高点，显示出意想不到的 看跌订单流。 
>
> 令人吃惊的证据并不一定会使你对未来价格趋势的计划失效，但它应该让你保持高度警惕 ，密切关注接下来的价格走势。
>
> 下图
>
> 假设我们预期未来趋势将继续推动阻力位，并最终突破至更高价格。
>
> 然后，出乎我们意料的是，下一根蜡烛是低位收盘的熊烛，显示出强烈的看跌情绪。在这 种情况下更是如此，因为将最新形态与市场结构和之前的价格走势结合起来看，我们会发 现，价格已经从阻力区域强势突破，并跌破最近的震荡低点，从而迫使趋势发生改变。 
>
> 显然，这与我们最初的计划不符。
>
> 我们与当前的价格走势不同步。是时候修正我们的预期了。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080142378.png)

# 12.0过程总结

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080144463.png)

## 12.1步骤一

> 步骤 1 - 确定k线形态的倾向性
>
> 对k线形态进行分类，确定价格的短期走势。
>
> 操作
>
> 1.k线形态分类，
>
> 最高价/中间价/最低价 收盘价 
>
> 多头k/区间k/空头k 
>
> 2.确定图案的情感

## 12.2步骤2

> 每种模式都是独一无二的，必须结合其出现的市场背景环境加以考虑。
>
> 操作
>
> 1.当前价格走势与主要市场结构特征的关系：
>
> 支撑或阻力 
>
> 趋势 
>
> 波段高点和低点 
>
> 2.这对形态的情绪和未来潜在的价格走势意味着什么？

## 12.3步骤3

> 第 2 步--考虑背景
>
> 是市场行为如预期般持续，还是有什么迹象表明我们与市场流动脱节了？
>
> 操作
>
> 1.当前的价格走势和情绪是否支持我们之前对未来价格走势的预期？ 是 ▪ 等待进一步的价格信息。
>
> 没有 ▪  决定是继续持有下一根k线，还是重新考虑 初始市场分析。 
>
> 不确定 ▪ 等待进一步的价格信息。

## 12.4步骤4

> 操作
>
> 当图表上出现新信息时，重复该过程。

## 12.5案例1

> 我的预期是，价格将继续保持当前的趋势状态，直至到达 1.5560 或附近的 Spt A 区域。 
>
> 怎样的价格走势才能验证这一分析？ 
>
> 我们需要看到在看跌波动中继续走强，在看涨波动中继续走弱。 
>
> 英国时段的开盘至关重要。它可能导致短期波动。任何在开盘时推高的走势都应迅 速遭到强烈拒绝，并且不应突破上一波段的高点。
>
> 什么样的价格走势会使这一分析失效？
>
> 如果市场在开盘时表现出持续的强势，尤其是突破上一个波段的高点，则需要进一 步分析。 让我们看看下面的价格走势

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080149698.png)

> 我们将通过图表逐条考虑当前市场分析过程的前三个步骤：
>
> 1.判断k线形态的走势 
>
> 2.考虑背景 
>
> 3.它支持我的前提吗？ 
>
> 当一根k线显示出重要信息时，我会通过这三个步骤进行分析。如果                                                       k线提供的新信息很 少，或者提供的信息与周围的k线相似，可以归为一类，为了节省时间，我将只总结我的 想法。
>
> 在您阅读这篇文章时，请注意这并不是我在完成每支k线时都要机械地按照检查表进行检 查的过程。这里的注释是按照核对表进行思考的近似过程。实际情况是，随着经验的积累 ，很多分析都是在k线图形成时实时进行的，而不仅仅是在每根蜡k线结束时。
>
> 无论如何，虽然这篇文章很长，但我希望它能帮助你看到这个过程是如何一根根k线地修 改你的前提的，并帮助你保持专注。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080150786.png)

> k线 A 
>
> 高位收盘多头k - 非常看涨的开盘走势 
>
> 不接近 S/R。趋势定义不变。值得注意的是，该k线未能继续跌破前一根k线的 低点，而是反弹了足够长的距离，回调了之前两根低位收盘的看跌k线。目前尚未 突破近期波段高点。 
>
> 虽然比我希望看到的更为看涨，但开盘时可能会出现波动。除非突破波段高 点，否则前提不会失效。不过，我已保持高度警惕，需要看到这波反弹迅速停滞。 
>
> k线 B 
>
> 中间收盘范围k线 - 中性情绪；由于k线 A 的看涨收盘位置和k线 B 下方的尾部，中 性偏看涨。 
>
> 趋势定义不变。未能继续走高。回调中出现了一些卖盘，可能已经停滞。
>
> 这支持了我的前提。未能继续走高表明最初的多头缺乏决心。理想的情况是，这种疲 软态势将持续下去，价格将从这里开始下跌。然而，价格走势可能会继续第二次冲高 。除非突破波段高点，否则前提仍然有效。未来的趋势方向仍然是下跌。 
>
> k线 C 和 D 
>
> 两个中收盘蜡烛图--显示中性情绪，看涨方向持续疲软。 
>
> 回调已经停滞。价格测试了 B 下方，吸引了一些买盘，但只足以达到中间收盘价。 
>
> 前提依然存在。仍期待趋势继续向下。 
>
> k线 E 低位收盘空头k - 强烈的看跌情绪。 
>
> 跌势继续，跌至新低。正如预期的那样，前一个波段低点被跌破。这根k线将困住未 能在跌破开盘k线 A 时出局的多头。 这很好地支持了我的前提。我预计下跌趋势将继续向更低的支撑位发展

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080153407.png)

> k线 F（摘要） 
>
> 与k线 E 相比没有变化。 
>
> k线 G 
>
> 1.高位收盘范围k线 - 情绪中性，略微看跌。 
>
> 2.下跌趋势保持不变。窄幅震荡表明多头没有作出承诺，但空头出现了短期获利回吐。 
>
> 3.这支持了我的前提。看跌方向的力量仍在继续。从 G 形成的任何回调都需要表现出弱 势。由于多头被困，预计 A 低点会有一些阻力。价格不应超过 1.5590/600。 
>
> k线 H 和 I（摘要） 
>
> 从k线 G 开始，前提没有改变。 
>
> k线 J 
>
> 低位收盘空头k - 看跌情绪继续，如 E 和 F 所示。 
>
> 跌势继 续，跌破新低。 
>
> 价格走势仍然支持我的观点。看跌力量依然存在。回调依然无力。预计会放缓进入支 撑位。如果我们再次回调，应该会再次走弱。 
>
> k线 K 
>
> 高位收盘多头k。这真是个惊喜。看涨情绪。 
>
> 完全反转了前一根低位收盘的空头k。虽然在突破 A 点之前不会触发趋势的改变，但没 有突破 I 点的高点，这将具有重要意义。现在空头被困，这将减缓对 J 点低点的任何 回测。 
>
> 我的前提是下行强劲，回调乏力。为了维持我的预期，这次强势回调必须迅速失败。 我保持高度警惕。进一步上行需要重新评估我的未来趋势方向。需要立即反转走低， 以确认我当前的计划。 
>
> k线 L 至 Q（摘要） 
>
> k线 L 至 Q 未能继续走高。看涨k线 K 无法战胜看跌的下降趋势订单流。跌至 Q 点时表 现疲软；考虑到 J/K 反转中的空头被套，这也不足为奇。 
>
> K 线走强后，L 线至 Q 线走弱，这让我不得不暂时关注 Q 线附近的反转（重新测试 J 线低 点）。如果那里出现反转，我就会将预期改为复杂的回调，有可能回调到 A 点附近（根 据未来趋势方向的第二条原则）。 
>
> k线 R 
>
> 低位收盘空头k - 看跌情绪。 
>
> k线 R 继续向支撑位移动。虽然通过 R 有一些加速，但这很可能是由于 J 下方的止 损和突破进场指令造成的。 
>
> 随着 S/R 的临近，最初的前提已经不复存在，是时候寻找未来的道路了。是时候从第 一原则出发重新考虑我们的分析了。
>
> 接近 S/R 的趋势并不太强大，因此我在寻找一个 能够成立的测试（根据未来趋势方向的第五项原则）。如果我错了，价格确实突破了 支撑位，我预计突破将被否决，不过我会观察突破后的价格走势，以寻找进一步的线 索。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080153407.png)

> k线 S 到 U（摘要） 
>
> 市场测试了k线 T 上的点位。这已经发生了。这里需要密切关注价格走势，在 S/R 区 域也是如此。任何突破低点k线的行为都会带来新的前提；预期会出现修正，包括 在重新测试支撑位之前的复杂回调，或者如果显示出看涨力量的迹象，则可能出现反 转，预期未来趋势会反弹至上方阻力位 Res A。 
>
> k线 V 
>
> 高位收盘多头k--看涨情绪 
>
> 看涨压力使价格反弹，突破了近期 3 根k线的密集低点。请注意，这并没有改变趋 势定义，在突破 L 值之前也不会改变。k线顶部的小尾巴显示了一些卖盘，这并不完 全出乎意料，因为我们正处于 R 值跌破 J/K 反转线的附近。 
>
> 这是否支持我的假设？如上所述，突破低点后，我对未来趋势有了新的预期--预期会 继续走高，进行复杂的回调，或可能反弹至 Res A。 低点）在继续之前，我预计会有短暂的停顿。为了确认我的前提，任何回调都应该是微 弱的。如果跌破 T，则前提失效，需要重新评估。 
>
> k线 W 至 a（摘要）
>
> k线 W 至k线（a）形成较弱的回测。这一看跌的价格波动势头较弱，无法回调整个 V 形 体。现在，从 T 到 V 的上行走势强劲，而从 W 到（a）的走势疲软。强势是看涨的一面， 弱势是看跌的一面。我的前提得到了支持，我预计价格很快会继续走高。 
>
> k线  b 
>
> 高位收盘多头k--非常看涨。 
>
> X 以上触发止损，助推市场走高。 
>
> 这在很大程度上支持了趋势反转和向阻力位 A 移动的前提。 
>
> k线 c 至 e（摘要） 
>
> 市场开始走强。客观趋势定义已被确认为向上。虽然在阻力位之前可能会出现停顿或回调 ，但我的前提是继续向阻力位前进。如果这样的强势持续到阻力位，我将期待突破。突破 后的价格应密切关注突破或突破回调时的疲软迹象。 
>
> 到目前为止，这个例子的前提（我们对未来趋势方向的预期）被证明是有效的。让我们快 速回顾一下前提被证明无效并需要修正的情况。

## 12.6案例2

> 下图
>
> 下方支撑位在 1.5900。上方阻力位在  1.5695。
>
> 早些时候试图突破阻力位的尝试失败了（就在图表左侧），随后价格持续回调，出现了一 段疲软期。最近市场上出现了看涨力量，为第二次测试阻力区做好了准备。
>
> 我们认为，未来趋势方向的前提是趋势延续至阻力区域。
>
> 鉴于最近两根k线（低位收盘区间k和中收盘多头k）的疲软态势，我预计在测试之前 会出现回调。回调后的价格走势应显示出疲软，最好能维持在密集区 （1.5935 附近）之上，这样前提才能继续有效。
>
> k线 A 
>
> 低位收盘空头k--看跌情绪，尽管尾部较低是一个积极信号，显示回调时的买盘压力。 
>
> 这根k线开始了我们的回调。请注意，它也在测试最初的上冲点（绿色大k线的低点 ）。从较低的尾部可以看出，这里预计会有一些支撑。 
>
> 这种价格走势支持我的前提。我预计看涨延伸时会走强，看跌回调时会走弱，趋势将 继续向阻力位发展。
>
> k线 B 至 D（摘要） 
>
> k线 B 至 D 均显示出中性情绪，并确认了回调的弱点。价格走势应该会从这里开始反 弹，以支持我们再次冲向阻力区域的前提。 
>
> k线 E 至 G（摘要） 
>
> 这种回调在低位维持的时间比我希望的要长，但是k线 E 至 G 显示出越来越强的看涨情 绪，从 E 和 F（均为高位收盘范围k线）的看涨/中性到 G（高位收盘多头k）的看涨。 这三根k线的主要特征是尾部，其中 低价测试被否决。如果不能下跌，那就上涨！！！最初的分析看涨力量之后，市场出现了 微弱的回调，回调至 G 点，虽然持续时间较长，但现在似乎已经结束，市场又恢复了一 些力量。预计将从这里继续向阻力区移动。 
>
> k线 H 
>
> 高位收盘多头k（刚刚）--看涨，但力度较弱。 没有突破 A 点的波段高点。 
>
> 前提没有改变，不过我更希望看到更强劲的推动力，并在这根k线或下一根k线中突 破k线 A 的高点。继续延伸的力度应该比现在更大。 
>
> k线 I 
>
> 低位收盘空头k--看跌情绪。 
>
> 价格反转，跌破并收于k线 H 的低点下方。尚未测试波段高点 A 和波段低点 G。除 非价格在下一根k线中强劲反弹，否则我们将看到一个潜在的 123 形态，H 图将产 生一个更低的高点。 
>
> 最新的k线并不符合我的预期。反弹本应出现在强势上。从 G 到 H 的动能比 A 之 前的绿色大阳线更弱。我现在的预期是出现复杂的回调（第二原则）；第二段下跌， 维持在 G 低点上方，然后再次向阻力位推进。要支持我的前提，价格必须在 G 低点显 示出减弱的力量，然后反转。要使我的前提失效，价格必须突破 G 低点。 
>
> k线 J 
>
> 低位收盘空头k--看跌情绪。
>
> 价格刚刚突破 G 低点（一个点）。需要注意的是，在跌破之前延长回调/盘整的低点之 前，趋势尚未改变。
>
> 在现阶段，我没有真正的前提。我需要更多的信息。我会等待对这些低点的测试，如 果这些低点得以守住，就会形成一个横盘区间，如果这些低点被跌破，就会形成一个 下跌趋势。 
>
> k线 K 
>
> 低位收盘空头k - 情绪看跌。 
>
> 低点已经失守，趋势已转为下跌。 
>
> 上一次看涨走势（G-H）显示出疲软。目前的看跌走势则表现强劲。未来趋势方向向 下，预计跌势将延续至支撑位 1.5900。 
>
> 这其实是一个非常简单的过程。如前所述，如果你觉得自己被太复杂的东西缠住了，可以 回到基本原则上来 您已经对价格走势有了预期。 最新的价格走势是否支持这一前提，还是需要重新考虑？ 随着经验的积累，这个过程也会变得越来越容易。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407080200065.png)

# 13.0问题

> 标出流动性区域，就是多头止损单的位置，空头止损单的位置，做突破挂单的位置。
>
> 问清楚自己到底是买方衰竭，还是空头把多单都吃掉了
>
> 多头/空头在哪会止损放弃
>
> 现在是多头盈利还是空头盈利
>
> 踏空的人现在什么感受
>
> 被套的人现在什么感受
>
> 
>
> 1.市场的赢家和输家
>
> 牛市和熊市谁在主导当前的波动？
>
> 是否正确？ 
>
> 如果他们错了：
>
> 这一走势可能在哪里停滞？
>
> 相反的订单流可能会从哪里进入市 场？ 
>
> 这些交易者会在哪里设置止损点？
>
> 如果他们是对的：这些交易者的目标在哪里？他们打算在哪里获利或减仓？
>
> 如果方向是对的，但是晚了： i. 在这一走势中，哪些地方最不适合晚进场？哪些地方会阻止后 期交易者出场

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407091724260.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407091724575.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407091725475.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407091725628.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407091725640.png)

# 14.0预期公式

> 期望=(盈利%x平均盈利)-(亏损%x平均亏损)
>
> 正期望值要求您的交易策略（以及您对该策略的执行）最大限度地提高以下两个比率：
>
> 胜率：胜率 = 胜出交易次数除以样本中的交易总数。
>
> 我们的目标是尽可能提高交易的获胜率，请注意，最大限度地提高这一比率也会使损失率降至最低
>
> 赢/输规模比 (WLSR)
>
> WLSR = 平均胜场除以平均负场 
>
> 我们的目标是使我们的平均赢面大于平均输面。
>
> 大多数交易者将所有精力都集中在最大限度地提高胜率上。而很少有人致力于最大限度 地提高他们的 WLSR。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092212701.png)

# 15.0策略规则

> 市场不是价格变动。市场是交易者做出的交易决策。
>
> 持续获利的方法是寻找那些有足够数量的交易者做出交易决策的可能性较高的机会，这将 导致订单流向某个特定方向，然后根据订单流进行交易。
>
> 我们已经看到，单个交易者的决策通常是不可预测的，这导致他们在市场中没有优势或优 势极小。然而，在压力较大的时候，他们的决策就变得更容易预测。
>
> 因此，我们的交易方法必须基于对如何从市场中获利的基本理解：
>
> 我们会确定有足够数量的交易者将承受压力的区域，并做出交易决策来缓解他们的 压力，然后在他们之前或与他们一起采取行动，以便从由此产生的订单流中获利。
>
> 在图表上找到其他交易者会做出交易决定的区域，你就拥有了自己的 优势。
>
> 在净订单流量发生变化时或之前入场，您就有了获利的绝佳机会（前 提是您能很好地管理交易）。

## 15.1弱势

> 未来的趋势是朝着强势的方向，与弱势的方向相反。
>
> 因此，我们的目标是始终朝这个方向进行交易--以力量对抗弱点。
>
> 我们不会通过识别新的强势并顺势入场来做到这一点，因为这样做通常会太晚。相反，我 们更倾向于识别弱势，并在弱势让位于强势时或之前反向入场。
>
>
> 沿着弱势方向进入 S/R 区域的交易者进行的交易概率非常低。进军这一地区的努力很可能会失败。
>
> 进入显示疲软的突破的交易者正在进行概率极低的交易。突破很可能会失败。
>
> 突破出现减弱（首次回调时表现疲软）的交易者正在进行概率极低的交易。突破回调可能会失败，导致突破方向继续。
>
> 试图抓住趋势反转、在微弱回调时逆势进场的交易者所进行的交易概率非常低。回调很可能会失败，从而导致趋势的延续。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092224853.png)

## 15.2被套牢的交易者

> 看待我们架构背后思想的另一种方法是，我们在辨识被套交易者，并且在与他们相反的方向交易。
>
> 我们的目标是在图表上找出其他交易者正在与市场观点抗争的那些地方。我们辨识他们被套或(即将被套)，认识到自己错了并被迫离场的那些区域。我把这些人叫做被套交易者。
>
> 对这种策略来说，被套交易者的概念非常重要，在你的交易过程中应该时刻想着。密切注意被套入亏损头寸的交易者。
>
> 你知道这种感觉。我们都做过这样的交易。还记得你进入完美突破的时候，突然反转回到 突破点下方，让你瞬间陷入缩减和低概率交易。看着价格威胁到你的止损点，恐慌感油然 而生；你坚持下去，希望价格回升；但往往止损似乎是不可避免的结果。

> 下图
>
> 在左侧，我们看到的是一个具有强烈看涨倾向的上升趋势市场。回调发生时，走势与之相 反，显示出一根强烈的看跌k线（低位收盘的空头k），随后跌破波段低点支撑区域。空头 将在此进场，希望抓住反转的机会。
>
> 然而，令他们大失所望的是，突破性阳线最终变成了一根窄幅的中位收盘空头k。动能并未传导下行趋势。紧接着是一根高位收盘区间k。仍然没有继续下行的迹象！然后，市场以大幅 回升的走势（高位收盘多头k）套牢空头。这根绿色k线的大幅波动是由于被套牢的空头被 迫离场，第一个止损点被执行。新的看涨压力将价格推向新高

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092232813.png)

> 在右侧，我们看到的是另一种类型的受困交易者情况。当价格跌破盘整区域，然后向突破 点爬升时，市场出现看跌倾向。 多头在反弹后期进入市场，并直接进入阻力区域，是在进行概率极低的交易。这些交易者 很可能是根据滞后指标触发而入市的。这些交易者就是支付我们工资的人。 
>
> 反弹暂停，然后向下回落。强劲的低位收盘空头k是第一批被套多头执行止损的结果，因为 他们被迫亏损离场。 
>
> 在这个例子中，还有其他被套牢的交易者。想想那些在阻力区买入的交易者，他们在最初 向下突破之前买入。他们经历了剧烈的缩水和巨大的心理痛苦，拼命等待价格至少回到盈 亏平衡点。随着价格回升到突破点，希望也越来越渺茫。如果他们是聪明人，就会以小亏 损出局。但大多数人不会这样做；他们对继续突破阻力位并获利的渺茫希望足以让他们多 持有一段时间。当价格再次从阻力位下跌时，他们就会被迫退出--因为他们对自己和市 场拒绝让他们实现盈亏平衡感到愤怒
>
> 所以，你可以看到这个设置包含了两组被套多头--最初突破前的多头和反弹后期进入的多 头。
>
> ==不要沉迷于寻找设置。市场分析中最重要的任务是保持对市场结构的认识，以及对未来订 单流的偏向和可能路径的感觉。==
>
> 保持态势感知，交易设置会向您展示。被困的交易者模式将会向你显露出来。
>
> 去寻找设置，你就会失去对市场大局结构的态势感知。在较长时间框架的市场行为背景下考虑时，您最终会发现并采取赔率较低的设置和交易。

> 查看左侧图表，很容易让自己相信您已经发现了被困的空头。市场已下行至1.5100整数区域并找到支撑。看涨压力正在进入市场。您确定后期空头将在突破该价格走势时被困，并在最后一根绿色k线的高点上方设置止损入场订单，以便尽早入场。
>
> 分析不好！
>
> 右侧图表显示的是套牢者被套牢后的快速损失。市场分析没有考虑到：
>
> (1) 看跌倾向的强 度；
>
> (2) 1.5100 点不是一个重要的支撑位（以前没有S/R 或波段 H/L 支撑位） 。 
>
> 这种交易没有考虑到我们是顺强势逆弱势。 我通常会在注意力不集中时做这种交易。我发现自己很容易分心，注意力转移到其他地方 ，不知怎的，我的思绪又回到了屏幕上，正好看到 1.5100 水平的滞涨和潜在的多头入场 。匆忙下单，而不是停下来根据第一原则进行分析，让我付出了金钱的代价。 什么时候可以在这一区域进场？为什么不等待市场出现明显的反转，然后对该水平进行较 弱的回测？然后，我们就可以在供需失衡的成熟区域进行交易，对抗弱势。 不要急于进场交易。找出弱点。识别被套牢的交易者。避开弱点，参与订单流，从而解套 。 
>
> ==寻找交易机会的最重要因素是......对市场结构和未来可能的趋势方向保持良好的认识==

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092241340.png)

# 16.0交易设置

> 机会存在于 S/R 水平（较高时间范围 S/R、范围 S/R、波动 H/L）以及趋势内的回调。在这些区域中，通过价格行为的弱势来找到这些区域的机会，从而将其他交易者陷入低概率的位置。

## 16.1设置定义

> YTC 价格行为交易者有五种主要设置。
>
> 当价格与支撑位或阻力位相互作用时会发生三种情况：
>
> TST - 预计将保持对支撑位或阻力位测试，。
>
> BOF - 突破失败，价格突破支撑或阻力区域后反转。
>
> BPB - 突破性回调，价格突破支撑或阻力区域并保持不变(前进)。
>
> 趋势中出现的两个：
>
> PB - 趋势中的简单（单腿）回撤。 
>
> CPB - 趋势中的复杂（多波段或持续时间较长）回撤。

### 16.1.1TST

> TST 设置是对支撑位或阻力位的测试，预计支撑位或阻力位将保持不变。
>
> 支撑位或阻力位最好是较高时间框架的 S/R，或者是横盘交易区间的上限或下限。
>
> 在趋势疲软的环境中，它可能会成为交易时间框架内的波段高点或低点，为短线头皮回调 提供逆势入场机会（如果幸运的话，还可能提前进入反转），尽管这种设置的概率要低得 多。
>
> 当我们对未来趋势方向的判断使我们预期某个支撑或阻力区域将保持不变时，我们就会在 该区域进行 TST 设置。只有当设置提供了可接受的 R:R 参数和 S/R 区域内的批发入市触 发器时，我们才会进行交易
>
> 这种设置通常表现为进入 S/R 区域的弱势，不过，任何进入 S/R 的严重过度延伸走势都可以考 虑这种设置。在进入 S/R 区域时，如果交易者进入较晚，则进入的概率较低，一旦价格停 滞并反转，则会被套牢。
>
> 这种反转将触发他们的止损，增加反转订单流。
>
> 我们的目标是利用反转订单流进行交易，从被困交易者的止损行动中获利。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092314104.png)

### 16.1.2TST案例

> 下图
>
> 当价格接近阻力区域时，我们要保持警惕，等待 TST 设置。只有达到可接受的交易 R:R  参数和适当的交易触发器（稍后详述），我们才会进行实际交易。现在，只需确定设置位 置。 
>
> 请注意，设置的价格走势并未触及我的阻力线，但却触及了阻力区域。重要的是要记住， S/R 是一个区域，而不是一条线。图表上的线只是提醒我们 S/R 的存在。向左看才能找到 实际的影响区域。 

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092318577.png)

> 下图
>
> 显示了在较高时间框架（30 分钟）支撑位设置 TST 的图表示例。再次强调 ，当价格接近支撑区域时，我们要对 TST 设置保持警惕。当且仅当我们获得可接受的交 易 R:R 参数和适当的交易触发器时，我们才会进行交易。 请注意，在这种情况下，测试涉及两次向支撑区域的推进，以及两个潜在的交易入场位置 。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092332406.png)

### 16.1.3BOF

> BOF 设置是突破支撑位或阻力位但失败。
>
> 支撑或阻力将是较高的时间框架 S/R 或横盘交易区间的上限或下限。在弱势趋势环境中，它还可能提供波段高/低的反趋势交易机会（但这是一个较低概率的机会）
>
> 当我们对未来趋势方向的原则导致我们预期支撑或阻力区域可能会突破时，我们会密切关注任何突破的价格走势，以寻找进一步疲软的迹象。突破的疲软将提醒我们可能存在 BOF 机会。仅当设置提供可接受的 R:R 参数和批发入场触发器时，才会进入交易。
>
> 下图展示了在阻力位和支撑位设置 BOF 的示意图
>
> 由于突破 S/R 吸引了突破交易者，所以这一设置有效。但是，突破无法吸引足够的新订单 流来继续推进，因此表现出疲软。突破交易者被套牢。如果回落到 S/R 之前的区域，就会 迫使他们退出头寸，从而增加订单流，与最初的突破方向背道而驰。我们的目标是突破失 败，回到 S/R 之前的区域。 
>
> 一个常见的问题是："在你停止寻找突破失败之前，你能接受突破后多少个价格柱？ 没有固定的数字。
>
> 每一次发生的情况都应根据其自身情况加以对待，并从突破交易者的角 度加以考虑。价格走势是否让他们感到恐惧，并有可能放弃头寸？如果是这样，那么无 论有多少k线出现，它仍然是一个潜在的 BOF 设置。 
>
> 例如，市场在突破后两次尝试移动价格。第二次失败往往市场会做相反的事情。如果在突破后，我看到两次试图推高价格失败，我就会尝试建立一个  BOF 进入点。 
>
> 不过，话虽如此，我还是要说，很少能看到它坚持超过在 3-5 根交易k线。 交易时间框架k线。越快越好！

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092333994.png)

### 16.1.4BOF案例

> 下图显示了阻力下的 BOF 设置
>
> 在这种情况下，横盘区间的突破是由一个新闻事件--每月发布的非农就业数据（NFP）--引 发的
>
> 因此，突破被认为是大概率事件。
>
> 观察突破情况，我们发现价格明显停滞在阻力区上方。这是疲软的迹象。如果突破包含了 力量，那么它就会继续。 
>
> 只要我们有可接受的 R:R 参数和合适的入场触发器，我们就找到了一笔交易。
>
> 注意：对于剧烈波动的新闻峰值需要谨慎。我建议在价格恢复正常波动率之前不要进场。 在本案例中，设置发生在新闻发布 6 分钟后，明显停止了发布后的任何波动。
>
> 下图显示支撑位突破失败。
>
> 当价格走势放缓进入支撑区域时，我们最初会寻找（并可能交易）任何 TST 设置。
>
> 但是，您会注意到，每个 TST 设置都无法将价格推向新高。这显示了看涨方向的疲软。 虽然在看跌方向上没有表现出很强的力量，但未能继续做多表明更强的方向是下跌。
>
> 我们对突破和突破后价格走势的任何疲软迹象保持警惕。 在这种情况下，突破未能吸引足够的看跌订单流继续。它所吸引的订单流现在被空头套牢 ，如果价格回升到支撑区域上方，这些订单流将被迫退出。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092340149.png)

### 16.1.5BPB

> BPB 设置是指突破支撑位或阻力位后，价格在新区域内被接受，价格维持在突破点之后， 并形成较弱的回调
>
> 支撑位或阻力位将是较高的时间框架 S/R，或者是横盘交易区间的上限或下限。
>
> 当我们对未来趋势方向的判断使我们预期支撑或阻力区域可能会被突破时，我们会密切关 注突破时的价格走势，以寻找进一步走弱的迹象。突破时的疲软会提醒我们可能出现  BOF 机会。回调时的弱势将提醒我们可能出现 BPB 机会。只有当设置提供了可接受的  R:R 参数和批发入市触发器时，我们才会进入交易。 
>
> 下图显示了阻力位和支撑位的 BPB 设置示意图。 
>
> 这种设置之所以有效，是因为许多交易者倾向于在突破处反向操作，期待突破失败。如果这种 失败得不到其他交易者的充分支持，任何回调都将是微弱的，而且本身也会失败。突破失 败就是突破回调（失败的 BOF = BPB）。 
>
> 如果突破继续，那些在弱势回调中交易的人将被套牢。他们的离场指令流将有助于将突破 推向新的高点/低点。 注意：在重新越过 S/R 水位之前进入的任何 BOF 设置都必须积极管理。对疲软迹象保持 警惕，并做好准备，一旦出现 BPB 机会，就抓紧建仓并反向操作。

### 16.1.6BPB案例

> 下图显示了两个突破性回调机会。
>
> 第一次发生在最初突破后的十分钟内。价格走势在突破时表现疲软，很可能会让你寻找  BOF 的机会。但回撤也很疲软。如前所述，失败的 BOF 是一种 BPB 设置。被划伤的  BOF 会带来少量损失。然后，第一个 BPB 提供了小额利润。
>
> 第二个 BPB 机会出现在突破后约半小时，显示了一个更好的阻滞阻力位，并出现了尾部 上部阻力。这个 BPB 设置提供了更大的机会（假设可接受的进场 R:R 参数和批发触发）

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092352917.png)

> 下图显示了一个突破口，为更灵活的交易者提供了 BOF 头皮和 BPB 的机会

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092353746.png)

### 16.1.7PB

> PB 是趋势中的简单（单腿）回撤。
>
> 当我们对未来趋势方向的判断使我们预期当前的上升或下降趋势将持续时，我们会密切关 注任何回调时的价格走势，以寻找疲软迹象。回调时的疲软会提醒我们可能出现 PB 机会 。只有当设置提供了可接受的 R:R 参数和批发入市触发器时，才会进行交易。
>
> 下图显示了趋势中的 PB 设置示意图。
>
> 这种设置之所以有效，是因为许多交易者都倾向于选择反转点。虽然每个人都说他们理解  "趋势是你的朋友 "这句话，但人性使我们中的大多数人总是在寻找反趋势的机会。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092355263.png)

> 现实情况是，市场在强势方向上运动，与弱势方向相反。我们观察这些较弱的回调，寻找失败的迹象，这 将使逆势交易者陷入亏损境地，并迫使他们退出。他们的出场指令流有助于我们的 PB 交 易获利。 
>
> 虽然回调可能在任何时候失败，但我们会密切关注价格在前期波段 H/L 区域的走势。这些 区域将成为潜在新订单流的来源，并将为回调的强弱和失败的时机提供线索。
>
> 如下图所示。 这并不是说，这些是我们预期回调失败和交易入场的唯一位置。只是说，我们密切关注这 些区域，观察价格与这些波段 H/L 区域的互动，寻找前进的线索。 
>
> 对价格走势进行持续的逐条分析会告诉你回调何时失败，如果在这些波段高/低区域之前 出现交易机会，对较低时间框架图表的监控将为你提供交易入场机会。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407092359458.png)

> 请注意，回调 A 和回调 B 都是简单的单脚回调，会导致下跌趋势的延续。 
>
> 回调 A 到达之前的波段低点支撑区域，也就是现在的阻力区域，然后价格停滞，随后恢 复跌势。停滞是回调疲软的明显证据。
>
> 同样，B 也是在趋势延续之前停滞不前。这一次，价格回撤到了之前的波段高点区域（请 记住，这是一个区域而不是一条线；在这种情况下，价格回撤到了波段高点区域的下部）

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100000409.png)

> 下图
>
> 我们看到单腿回调 C，它停在拥堵区域 D 的横线上。
>
> 然后回调 E，其停止在前一个波段高点 G 的横线上。另请注意在 F 处突破波段高点 G；供需严重失衡的证据。如果价格回到该区域，则任何价格快速波动的区域都值得关注，以寻找未来的支撑或阻力。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100002989.png)

### 16.1.7CPB

> CPB 是趋势环境中的复杂回调--由多个阶段和/或较长的持续时间组成。
>
> 当我们确定趋势减弱时，我们对未来趋势方向的原则使我们预期会出现复杂的回调，而不是简单的回调。在这次复杂的回调期间，我们对 CPB 机会保持警惕。
>
> 此外，失败的 PB 不会扭转趋势，也可以创造一个可能的 CPB 机会。
>
> 与往常一样，只有当设置提供可接受的 R:R 参数和批发入场触发器时，才会进行交易。
>
> 多波段回调可以提供相当强大的设置机会。事实上，CPB 往往比简单的 PB 更强大的设置。
>
> 左侧的上升趋势。当价格波段 3 跌破波段 1 和 2 之间的低点时，会吸引空头试 图进入反转。随后的停滞 并反转（趋势方向的延续）则会困住这些交易者。他们的出场指令流有助于推动我们的 交易利。 
>
> 我们如何判断何时应该等待 CPB 而不是 PB ？很大一部分原因在于您 感受市场流动。随着经验的积累，你会对此有所了解。
>
> 如前所述，趋势的疲软通常会导致我们对 CPB 产生预期。但是，当价格波动在趋势方向 上过度扩展时，我们通常也会预期出现 CPB。它很可能需要通过多次回调来纠正这 种情况

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100005044.png)

> 下图
>
> 注意回调的三个波段，其中第三个波段跌破了 A 点。这将吸引一些空头，他们希望提前 进入反转行情。但令他们失望的是，他们很快就被套牢了，因为价格又回到了 A 点上方 ，触发了他们的离场指令。
>
> 这种 3 个波段的回调困住了交易员的订单流，往往足以启动停滞的趋势。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100009756.png)

> 我们可以看到上升趋势缓慢拉回到之前的波段低点支撑位。 与易于交易的 3 次回调型 CPB 不同，这些持续时间较长的回调有时很难触发。总是有一 种诱惑力，让人想继续持有，等待更多的碾压动作和进一步的回调。当较低的时间框架（ 1 分钟）触发器出现在之前的波段 H/L 区域时，就应该有信心了

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100013198.png)

## 16.2适合每个特定市场环境的设置

> 让我们来讨论一下每个特定市场环境下的典型交易设置。 我所说的市场环境不是指过去的趋势，而是我们对未来趋势的预期。

### 16.2.1原则一

> 在 S/R 框架内： 
>
> 第一条原则 - 我们预计上升或下降趋势将继续其当前状态，直到下一个支撑/阻力障碍，除非趋势中显示出疲软的证据。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100114704.png)

> 如果趋势过度扩张，远远超过上升趋势 MA 线，或远远低于下降趋势 MA 线，通 常需要 CPB 修正后才能继续，除非是非常快速的趋势

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100116897.png)

### 16.2.2原则2

>第二项原则--当上升或下降趋势出现疲软迹象时，我们预计出现复杂修正而非反转的可能 性较高，直到市场显示出对新趋势方向的价格认可和强度。
>
>如前所述，主要机会是通过 CPB 设置。仅当价格顺利进入下波段点支撑（上行趋势）或上波段点阻力（下行趋势）区域时，最好在失败前突破该波段低点或高点时，才应采取PB设置，最好在失败之前突破该波段低点或高点。否则，坚持概率较高的多腿 CPB。通过仅交易这些更深的 PB 或多腿 CPB，我们拥有更大的受困交易者订单流的优势。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100121138.png)

> 在上升趋势的前期波段高点阻力位或下降趋势的波段低点支撑位，通过 TST 或  BOF，可能会出现概率较低的反趋势机会。通常情况下，只有在宽幅震荡的缓慢趋 势或明显放缓的趋势中，才会考虑这些机会，两者都显示出相对较小的预测。如果 选择进行这些交易，请积极管理。但正如下面的示例所示，它们可以为反转提供早 期入场机会

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100122280.png)



![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100122288.png)

### 16.2.3原则3

> 第三条原则--除非显示出向区间边界走强的证据，否则预计框架内的横盘趋势将继续维持当前状态。
>
> 由于存在突破受困的交易者订单流，边界处的高概率交易将始终是 BOF 设置。 但是，在没有表现出向边界S/R运动的真正强势时，我们就需要警惕简单的 TST  设置。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100124473.png)

> 如果区间内的价格走势显示趋势倾向于一个方向，您可以考虑在该趋势内进行  PB/CPB 交易。注意：低概率交易

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100124062.png)

### 16.2.4原则4

> 第四个原则 - 当横盘趋势显示出向范围边界走强的证据时，我们预计会突破边界。我们观察突破后的价格行为，以寻找未来方向的线索：
>
> 突破后弱势，预期突破失败并逆转，回到交易区间内。
>
> 回调无力--预期是突破性回调和延续。
>
> 这里的原则提供了明确的方向--观察突破后的价格走势是否疲软，以寻找 BOF 和/ 或 BPB 的机会。如前所述，两条腿都可能出现明显的疲软。在出现强势之前，任 何 BOF 交易都应谨慎管理。随后的回调疲软将表明 BOF 交易可能失败。对任何  BPB 触发保持警惕，允许 BOF 退出和反转 BPB 进入。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100126689.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100126785.png)

### 16.2.5原则5

> 在 S/R 框架的边缘：
>
> 第五条规则--我们预期对框架S/R的测试不会突破,除非在接近S/R边界时表现出强度

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100127885.png)

### 16.2.6原则6

> 第六条原则 - 如果在接近 S/R 障碍时表现出强势，我们预计会出现突破，并观察突破后的价格行为，以寻找未来方向的线索：
>
> 突破后的疲软--预期突破失败，并通过 S/R 区域反转。 
>
> 回调无力--预期是突破性回调和延续。
>
> 这里的原则提供了明确的方向--观察突破后的价格走势是否疲软，寻找 BOF 和/或  BPB 的机会。如前所述，两条腿都可能出现明显的疲软。任何 BOF 交易都应谨慎 管理，直至出现以下情况 优势。随后的弱势回调将表明 BOF 很可能失败。对任何触发 BPB 的情况保持警惕 ，允许 BOF 退出和反转以进入 BPB。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100128716.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407100128063.png)

## 16.3逆趋势操作

> 当趋势走势强劲时，反趋势交易永远是概率较低的交易。
>
> 相信这一趋势会持续下去，直到出现明显的减弱迹象。
>
> 接近 S/R 障碍时，预期它们会被突破。在突破后的第一次回调中寻找机会。
>
> 预计回调幅度较小，甚至可能在到达之前的波段高/低点区域之前就已反转。
>
> 如果您发现看似诱人的反趋势设置，要知道许多其他人也会看到它并接受这个低概率的入场。留意随后的反趋势设置失败，并将其作为您的趋势入场点。从强趋势环境中被困的反趋势者的止损订单流中获利。
>
> 在市场表现出明显的趋势减弱之前，避免进行逆势交易的诱惑。不仅仅是暂停或短期疲软
>
> 在市场趋势明显减弱之前，要避免逆势交易的诱惑。不仅仅是暂停或短期减弱--寻找强劲 而深入的回撤（与之前的回撤相比，回撤深度增加，力度加大），然后对低点/高点进行 较弱的回测。即使在这种情况下，由于短期被套牢的交易者订单量更大，因此更倾向于 以 BOF 反趋势入场，而不是 TST。谨慎对待所有 逆势 机会

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101432430.png)

## 16.4支撑压力坚守住

> 我们讨论过 S/R 保持区域（测试或突破失败）之后的一 段时间。我们观察强弱迹象，以确定未来可能的趋势方向--价格是会形成反转，还是会返 回进行后续回测。 
>
> 下图显示了在最初的 TST 或 BOF 设置之后可能出现的设置
>
> 在趋势不疲软的情况下（测试 S/R 时），预计趋势会持续（第一原则），这将带我们回去进行另一次 S/R 测试（第五或第六原则）。因此，我们寻找 PB 和 TST 或 BOF/BPB 设置。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101434060.png)

> 如果趋势中存在疲软（在测试 S/R 时），但在反转方向上没有走强的迹象，则在带我们再次测试 S/R 之前，预计会出现复杂的回调（第二条原则）（第五条原则）。或第六条原则）。因此，我们寻找 CPB 和 TST 或 BOF/BPB 设置。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101436677.png)

> 如果逆势走强，则预计会出现反转。在这种情况下，任何对 S/R 的回测都可视为新 趋势方向的回调（第一原则）。注意新趋势方向的 PB 设置。

# ![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101554886.png)17.0止损

> 止损的初始定位始终是处于使您的交易前提无效的价格水平。如果您对未来价格走势的预期正确，请确定市场中价格不会达到的点。
>
> 如果您随后进行交易并且价格触发您的止损，则表明：
>
> (1)您的交易前提是错误的（或者是正确的，但市场情绪已经发生变化，现在是错误的）
>
> 您的交易时机错误。
>
> 无论哪种情况，您都希望退出市场。止损离场是一种风险管理离场，目的是将损失降到最 低，让你继续参与交易。它应该受到欢迎
>
> 止损位置在交易时间框架上清晰可见，但我更喜欢使用较低的时间框架图来确定其位置。 它能让我们看到交易时间框架蜡烛图的内部运作，在较低的时间尺度上识别强弱。

## 17.1TST止损

> 下图显示了价格在阻力位的 TST 设置区域
>
> TST 设置很简单。如果您预期要测试某种 S/R 水平，而价格走势没有显示出足够的强度来 表明会出现突破，那么止损位置就应该在 S/R 水平的极值之外。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101657810.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407101700009.png)

## 17.2TST案例

> 如果正确，价格不应超过阻力区域，因此（如果进行交易）我们目前计划将止损设置在阻力区域上方。
>
> 确定了（暂定）停止位置后，我们继续确定潜在目标和入场触发点。如果价格未能提供入场触发并继续走高，我们将调整我们的预期（并可能调整我们的前提并为 BOF 或 BPB 设置做好准备）。
>
> 如果价格提供了做空的入场触发点，我们就在指示的位置下止损单。如果我们随后在这一 价位止损出局，则表明我们的交易想法和整个前提都是错误的。在损失最小的情况下出局 是件好事。然后我们继续寻找下一个机会。
>
> 在这种情况下，如果在下一根k线立刻出现触发信号，则另一种选择是将初始止损 点设置在较低位置，就在尾部上方。虽然这样做风险较小，但代价是可能会止损，而原来较高（阻力位上方）的止损点可能不会
>
> 请注意，在这些示例中......
>
> 任何止损单都应附加在入市单。它们尚未进入市场。我们只是简 单地确定其位置，以防交易入市触发。 
>
> 所有其他设置（BOF、BPB、PB、CPB）都不那么容易。不一定会有一条很好的 S/R 线， 我们可以将止损设在这条线之外。止损位置将取决于价格走势。 
>
> 但想法是一样的--如果交易前提被证明是有效的，我们就把止损点放在价格不应该变动的 位置。 
>
> 如果您在等待看涨交易的机会，那就等待空头向您展示他们的全部实力；然后将您的止 损位置定义为空头无法触及的位置
>
> 如果您在等待看跌交易的机会，那就等待牛市向您展示他们的全部实力；然后将您的止损 位置定义为牛市无法到达的位置。 
>
> 这可能包括初步（暂定）确定止损位，并随着更多价格行动的展开进行调整。然后，实际 的入市触发点也可能会改变止损位置。 其他时候，在触发k线之前，您可能没有任何止损位置的迹象。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102027897.png)

## 17.3BPB案例

> 下图重现了我们之前的一个 BPB 设置示例
>
> 我们预期价格将回撤至阻力区域。 
>
> 我将注意力转移到 1 分钟图表上，以查看更多细节。注意到价格在 A 处放缓，我初步确定 了一个（潜在）止损位置，该位置位于突破前拥堵点上方。 
>
> 如果价格真的到达那里，那么整个前提就是错误的。
>
> 但这并不一定成为我的止损点。当出现更多 1 分钟k线，我会继续监控，如果价格走 势显示价格不应超出的更近区域，我就会调整止损点。 
>
> 在 B 处，我们有明显的看跌情绪迹象。暂定止损点移到了价格波动高点上方。 如果价格随后触发进场，这就是在市场中设置的止损位置。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102039180.png)

## 17.4BOF案例

> 下图
>
> 左侧显示了我们早期的 BOF 例子之一。
>
> 看看第一个 BOF... 
>
> 如果进场触发，止损位置暂定在 k线 A 的尾部下方。 未触发入场。k线 B 随后创出更低的低点，尾部再次出现下挫。如果触发 BOF 入场，现 在应计划在蜡烛 B 下方止损。 仍未触发入场。k线 C 再创低点。如果入场触发，现在计划在止损位置 SP1 的该低点 下方止损、 当交易条目被触发后，订单将在 SP1 处进入市场。
>
> 快速查看更多的 BOF 机会... 
>
> k线 D 显示了第二次机会。请注意，如果止损点设在 SP2 的最近波段低点下方，您随 后就会止损出局，而设在 SP3 的更宽止损点（等于 SP1）则不会止损出局。 
>
> SP3 显然是首选，它低于所有近期波动低点支撑区域。它将是首选的止损位置，前提是它 仍能提供合适的 R:R。否则，SP2 也可以接受。 
>
> 第三个 BOF 机会出现在k线 E，止损点位于 SP3 的所有价格走势下方。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102044689.png)

## 17.5BP案例

> 下图显示了我们之前一个 3 分钟 PB 示例的止损定位。
>
> 由于价格在回调过程中有所放缓，最初的止损计划暂定为 SP1，即突破前价格走势的左下 方。 
>
> 当k线 A 出现时，我们可以将其移动到 SP2 位置，如果触发入场并成交，SP2 位置将提 供止损位置。 仅此而已。
>
> 只需将止损点设置在如果您进入交易，价格不应达到的位置，最好是超越某种 形式的技术（价格行为）障碍，如较高时间框架的 S/R 或交易时间框架的波段 H/L。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102048371.png)

# 18.0目标

> 我们的最终目标是在交易时间框架图上进行波动交易，因此我们用它来确定目标。不过， 如有必要，也可以使用较低的时间框架进行微调。 
>
> 第一个目标价位 T1 将是下一个价位，预计将提供对立的订单流。
>
> 第二个目标 T2 就在下一个较高时间框架 S/R 水平之前。如果价格处于历史时间的高点或低点（或至少是长时间的高点或低点），因此没有真正的 "下一水平 "S/R，我将瞄准 T1  以外交易时间框架价格停滞的第一个区域，或允许价格简单地趋势，并设置追踪止损
>
> 但请记住，我们不会简单地设置止损点和目标点，然后就一走了之。这些只是我们根据对 未来价格走势的预期，期望价格达到的初始区域。我们将积极管理交易，如果我们的预期 发生变化，我们的前提不再有效，我们可能会提前获利。

## 18.1BPB目标

> 在下图我们展示了一个 BPB 设置，T1 确定在 1.5940，离潜在的波段高点阻力位 不远，T2 确定在 1.5955，略低于下一个阻力位。这显然是（事后看来）运行第二部分而 不是瞄准 T2 的一个例子

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102149666.png)

## 18.2CPB目标

> 下图上升趋势中的 CPB 设置。 
>
> 初步止损位在回调低点 1.5890 下方。T1将位于波段高点1.5920之前。 
>
> 现阶段，价格已在较长的时间框架内保持了一个多月的上升趋势。较高时间框架（30 分钟 ）图表未提供任何可作为潜在第二目标的较高阻力区域。日线图在 1.6070 提供了潜在阻力 。根据我对价格走势的感觉，我要么在 T1 上方的第一个滞涨点离场，要么在 T2 水平  1.6060 上方追踪止损。
>
> 事后看来，我们以第一个价格档位为目标，在 1.5945 附近出局。追踪止损会在某个较低点退出，具体取决于其持有的力度。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102152220.png)

## 18.3BOF目标

> 下图 BOF 设置，因为 NFP 公布后价格走势停滞不前，未能突破横盘区间。 
>
> 随着我们重新进入横盘区间，我将对 T1 和 T2 采用相同的目标。T1 就在下一个支撑位上 方。我对价格到达下一个较低支撑位没有太大信心，我宁愿在同一位置（T1）获利了结  T2，然后再寻找机会。事后看来，T2 可以离第一个支撑位更近一些，但这就是交易--我们 很少能做到完美

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102157470.png)

> 下图
>
> 在较低的时间框架（1 分钟）图表上对 T1 和 T2 位置进行了微调，将其置于 最后一个波段低点的最低k线高点之上

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102201129.png)

## 18.4TST目标

> 下图显示了 TST 设置阻力位的目标。
>
> 初始止损点位于 TST 价格反转上方。T1 位于下一个 3 分钟波段低点 1.5023 的上方。T2  位于下一个支撑位 1.4989 的上方。 
>
> 正如您所看到的，分配目标是一个简单的过程。 
>
> T1 是下一个交易时间框架（3 分钟）区域，预计将提供对立订单流（波段 H/L、S/R 水平 ）。 
>
> T2 是 T1 以外的较高时间框架（30 分钟）S/R 区域，不过 T2 提供了更大的灵活性，您可 以根据自己的意愿将其调整得更近，或将其调整得更远，以（希望）获得更大的利润。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102202392.png)

# 19.0入场

> 入门 原则 
>
> 让我们从一些基本的入门原则开始。 
>
> 不完美 
>
> 我们应该使用突破式入场（止损入场单），还是通过回撤式入场（限价入场单）来获得更 好的价格？ 不幸的是，在交易结束并事后回顾之前，我们无法知道特定价格行为设置的最佳入场技术
>
> 下图
>
> 突破（止损单进场）是进入交易的最佳方式。价格突破了进场价， 然后就没有回头。在触发之前，回撤（限价单）进场的机会非常有限，触发之后当然也没 有机会了。 触发器。那些试图以更好价格入场的人则有可能完全错失良机。在这个例子中，突破式进 场显然是更好的选择

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102211499.png)

> 与突破式入市相比，获利潜力更大，风险更低。限价单入市是首选。
>
> 下图
>
> 左边我们看到一个突破性的进场触发了我们的多头头寸，就在价格崩溃 并将我们止损之前。通过限价订单获得更好的回撤入场价位，可以给我们一个小的缓冲期 ，在这个缓冲期内，我们的交易是盈利的，这样我们就有机会在收支平衡的情况下进行交 易，或者减少损失。在这种情况下，限价单显然是最佳选择。
>
> 右边我们看到了一个尝试 PB 进场做空的例子。市场发生了逆转，这意味着突破订 单根本没有成交，而限价订单却让我们蒙受了损失。在这种情况下，突破式进场避免了一 次亏损交易，因而具有极大的优势。 市场结构的性质和价格走势环境可以为首选方案提供一些很好的线索。平稳流动的市场可 能倾向于突破式入市。波涛汹涌的重叠市场可能会通过回调、限价单入市提供更好的机会 。然而，情况并非总是如此

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102217148.png)

> 因此，我们所能做的就是确保价格在我们乐意进入的区域内，并尽可能在该区域内获得 最佳价格。然后管理交易！

## 19.1批发区

> 下图
>
> 价格波动的盈利潜力有限。在反 转之前，它们只能波动这么多。当然，我们并不能绝对确定每次波动会走多远，但我们知 道它们最终一定会结束。 这是我们可以进场并确保盈利的空间，希望在反转夺走我们的收益之前

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102223756.png)

>批发价格出现在每次价格波动的早期；专业人士正在做空，期望价格更低，这样他们就可以平仓并获得利润。
>
>散户(零售)价格在每次价格波动中都出现较晚；业余散户正在做空，以响应一些 TA 触发因素，例如突破先前的波动低点或移动平均线交叉。很可能是专业人士在交易的另一端，买回空头头 寸以平仓。
>
>我的目的是尽早与大批专业人群一起进入。
>
>有些交易者可能会说，试图在走势中尽早进场就是试图选择顶部或底部。完全正确！为什 么不这么做呢？这是风险最低、盈利潜力最大的地方！散户入市会增加风险，降低获利潜力。
>
>下图显示
>
>该图显示了在突破前一个波段低 点时入市。 

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102230816.png)

> 下图
>
> 批量入市可确保降低风险，提高盈利潜力。

### ![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102232960.png)19.1.1如何界定批发区

> 如何界定批发区？ 
>
> 考虑交易时间框架图。我们的设置是围绕识别进入 S/R弱势、进入波段 H/L弱势 或趋势中回撤的弱 势而设计的。
>
> 我们发现散户交易者在这一走势中进入较晚，被困在低概率交易中，被迫退 出。我们的目标是在被套牢的交易者意识到需要离场时或之前进场。 
>
> ==这一点其实很容易识别。它基本上是对某种形式的反转形态或设置区域的拥堵区的突破。== 
>
> 在这一点上或之前的任何东西都是批发。此点之后的为零售。 
>
> 我把这一点称为最后批发价（LWP）。我的目标是在最后批发价或之前入场。在任何情 况下，我都不会在最后批发价之后入场，因为这样做会增加风险，降低潜在回报。如果我 在通过 LWP 之前错过了入场时机，我会耐心等待任何二次回测机会或下一次设置。 
>
> 请注意，我们不会在此时简单入场。如果可能的话，我们会利用较低的时间框架来寻求更 好的价格。这只是我们为确保批发价格而接受的最后价格。

> 以下所有示例均取自交易时间范围（3 分钟）。
>
> 下图展示了几种设置下的最后批发价 (LWP)。
>
> 在示例 (A) 中，我们看到的是  BPB 设置。突破支撑位后，价格回到突破点，然后出现情绪变化--两根多头k之后是一根低位收盘k线。继续跌破这根k线将开始触发止损（在这种情况下，既包括后期多头，也包 括最初向下突破前的被套多头）。这一点是最后的批发价。必须在突破该低位收盘范围k线时或之前入场。 
>
> 在示例（B）中，我们有一个 BOF，实际上是第二次进入 BOF 的机会。价格正在测试前 期低点。LWP 突破了最后一根空头k的收盘低点。这将引发两次向下突破支撑位的失败。 第一个止损点将被触发，帮助我们推高价格。必须在 LWP 点或之前入场，否则我将放弃 这笔交易
>
> 在示例 (C) 中，我们看到了阻力位的 TST。一连串的多头k突然让位于低位收盘的空头k，完 全逆转了之前的大多头k。这是情绪的快速变化。继续走低将开始触发止损。因此，这是我 们的最后批发价 (LWP)。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102247434.png)

> 示例 (D) 显示了上升趋势中的 PB 设置。最后批发价 (LWP) 位于尾部较低的绿色k线上 方，该蜡烛图迅速扭转了市场情绪。必须在此区域或之前入场。
>
> 示例 (E) 显示了上升趋势中的 CPB 设置。LWP 位于两根k线形态（低位收盘空头k线， 随后是完全逆转情绪的高位收盘区间k线）的上方。当继续高于该形态时，将触发止损。 
>
> 示例 (F) 显示了横向趋势中较低区间支撑的 TST。如收盘中期空头k和收盘中期区间k的尾 部较低所示，价格正缓慢进入支撑区域。止损点将收紧在这一停顿点上方（以及在价格突 破较低支撑区域时进入的新多头）。这就是我们的 LWP。我们必须在此点或之前入场。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102252528.png)

> 我们的批发区域是交易时间框架反转价格行动的突破点（包括突破点）；在这一点上，被 套在亏损头寸中的人将开始触发止损。
>
> 我们的目标是在这一区域或之前进入。 
>
> 如果错过了入场时机，我们不会追逐超出该区域的价格。我们要等待第二次重新测试的机 会，或者等待下一次机会。

## 19.2入场点原则

> 我们现在有两个最新的进入点。一个由价格走势（LWP）决定。一个由我们的风险管 理参数（LRP）确定。 
>
> 进场区位于止损价和两个最后进场价（LWP 或 LRP）之间。
>
> 争取在这一进入区域内进入，可确保：(a) 我们的进入价格在批发价格区域内；(b) 我们的 进入价格符合我们可接受的 R:R 参数

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102302942.png)

> 进入 前提条件 
>
> 价格在设置区域内 ，我们正在淡化价格与 S/R 或波段 H/L 互动时的弱势；或淡化趋势中回调时 的弱势。 
>
> 已确定停靠站点，如果我们的交易想法有效，就会确定一个价格不会超出的区域。 最好是 S/R 或波段 H/L 
>
> 目标已经确定，下一个交易时间框架波段 H/L 或 S/R 
>
> 确定入口区，审议了利比里亚工作方案和利比里亚复原方案

## 19.3简化的入市技巧

> 许多仍在努力实现稳定盈利的交易者会发现很难做出积极的入市决策，他们的决策 会受到各种负面心理的影响，从而导致犹豫不决和猜疑。简化进场技巧将帮助他们进场交 易。
>
> 简化的入市技巧是，一旦我们确定了 LWP 的位置，就在 LWP 处下达止损入市指令。
>
> 如果订单未被触发，而随后的价格走势提供了更好的 LWP，订单将被调整。如果后续价 格走势使设置无效，订单将被取消。 
>
> 这是最简单的入市方法。下一个止损单，然后等待。
>
> 重要条件：只有当进场的 R:R 为 1:1 或更大时，才能使用此方法。如果没有，则放弃交易 ，等待更好的进场机会或下一次设置。
>
> 当然，简化入市技巧的代价是，价格比通过工作入市获得的价格更低，因此 R:R 也会降低 。不过，它仍然有效。毕竟，LWP 是订单流应该协助我们交易的点位。在此之前的任何 进场都可能提供更好的 R:R，但这样做的风险是无法实现 LWP。
>
> 下图它们提供了 LWP 的示例。在使用简化入市技术时，我们只 需在此价位下止损入市单，等待市场触发我们的交易，然后开始我们的交易管理。非常简 单！

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102247434.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102252528.png)

## 19.4入场技巧

> 对于那些希望通过较低时间框架（1 分钟）的价格走势来积极管理入场，以获得比 LWP  更好价格的人
>
> 在一个完美的世界里，进入我们的 "进入区 "将是我们精巧直觉的结果。遗憾的是，我们 中的大多数人都无法在这方面获得专业技能。我们所能期待的最好结果就是随着经验的积 累而逐步提高。 
>
> 在学习阶段，我们大多数人都需要某种入市的触发因素。一些迹象能让我们有足够的信心 按下买入或卖出按钮。
>
> 我主要寻找两种迹象之一来决定是否入场。
>
> 第一种是价格走势停滞。
>
> 第二种是基于模式的触发。停滞更为罕见，也更为复杂。我们先 看它，包括一些例子；然后再看更简单的基于形态的触发器。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102321850.png)

### 19.4.1停滞

> 当价格明显无法继续超越设定的支撑或阻力区域（无论是较高时间框架 S/R、波段 H/L 还 是区间 S/R）时，就会出现明显的停滞。
>
> 停滞中k线的数量很难界定--每种情况都是独特的，你看到时就会知道--但我通常希望至 少有 3根k线。
>
> 如果您有信心守住一个水平，就可以在接近 S/R 区域的位置下限价入市单。
>
> 停滞不前的价 格走势为再次测试该区域提供了良好的潜力，允许以大幅折扣的批发价入市。如果随后证 明您错了（或早错了），那么风险已降至最低。但是，如果你是对的，那么回报潜力就会 最大化。无论如何......假设您的设置区域有效，这都是一个很好的入场机会。

> 下图显示了宽幅震荡上升趋势中的震荡低点 TST。如果你愿意，也可以称之为 CPB 。在这种情况下，我更倾向于使用 TST，原因很简单，因为上次从该区域开始的波动提供 了更强劲的动能，导致趋势转为向上。如果价格重返该区域，预计该区域将提供支撑。 
>
> 45 分钟后，价格确实回到了这一区域，通过形成滞涨形态，在这一波段低点支撑位显示 出看涨压力。 从较低时间框架（1 分钟）来看，在出现较大的绿色（高位收盘的多头k）后，对 滞涨的信心增强，从而可以在更接近 E1 处的滞涨低点时下达限价买入订单。
>
> 这提供了一 个低风险、高潜在回报的入市机会，远远早于 LWP 入市点。 当然，需要注意的是，这种入场方式的风险在于，如果支撑位被突破，我们就会进入一个 亏损交易，而如果我们仅仅依靠在 LWP 上买入止损，就不会进入亏损交易。 
>
> 不过，风险已经降到了最低，而获利潜力却最大化了。只要我们的分析确定了一个优质的 设置区域，并且在该区域有一个明确的停滞，这就是值得冒的风险。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102326183.png)



> 下图 例子要复杂得多，它显示了下降趋势中的 CPB 设置。
>
> 从左侧的交易时间框架（3 分钟）来看，我们有一个明确的止损区域，即位于 1.5619 的  S1。 不过，T1 引起了一些问题。通常情况下，根据下降趋势的定义，我们希望我们的延长线 能够突破下一个波段低点。
>
> 因此，在一个良好有序的趋势中，我很乐意将 T1 设置在波动 低点之后。但在这种情况下，价格走势并不有序。我对价格会突破波段低点没有太大信心 ，因此我将 T1 放在了波段低点 1.5603 的上方。 LWP 的基础是跌破拥堵点，即 1.5605。
>
> 这显然是不合适的（14 个点的风险换取 2 个点的 回报）。LRP 位于 1.5603 和 1.5619 之间的中间；或 1.5611。 除非我能在 LRP（1.5611）或以上入场，否则我不会对这笔交易感兴趣
>
> 从 较低时间框架（1 分钟）来看，我认为在第二次尝试突破阻力区（即交易时间 框架（3 分钟）图上阻力区的第四根k线）后出现了停滞。
>
> 在 E1（1.5611）处下达的入市 限价单将在两分钟内成交，为我们提供了一个批发入市机会，同时也符合我们的最低 R:R  要求。 
>
> 请注意，这笔交易提供了在 T1 点获利的机会，然后在 E1 点再次入场，进行第二次交易。 就我个人而言，我会放弃第二次机会，因为 T1 的价格走势太像弹簧了（"弹簧 "见下一节 ）。 然而，价格继续下跌至 T2，使得第二部分获得了更大的利润。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102333514.png)

### 19.4.2模式触发

> 其中包括任何较低时间框架（1 分钟）的价格行 为模式，这些模式包括
>
> 1.确认我们贸易前提方向的短期情绪，
>
> 2.以及 表示价格不应波动的区域。该区域可作为我们的止损点
>
> 例子包括 
>
> 1)任何标准烛台反转形态 
>
> 2)任何标准的价格柱反转形态 
>
> 3)证明输家错误的任何陷阱模式 
>
> a)钉子和壁架 b)双层 c)弹簧 d) 3 次回摆 e) 123 顶部或底部 f)测试突破点 g)膨胀

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102342512.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102342867.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102342338.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102342478.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102343619.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102343923.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102343774.png)

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102343161.png)

## 19.5限价单

> 当最后批发价（LWP）在我们的进入区域内时，我们就有机会通过括号价格来确保不会错 过交易机会。
>
> 在上面的例子中，您只需同时下达限价单和止损单。止损单设置在 LWP 位置（即我们的 简化入市技巧），以确保在市场突然走低时，您的止损单能够成交。然后，您根据需要执 行限价订单，争取在阻力区域获得更好的价格

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102354087.png)

## 19.6案例1

> 以下图表展示了入市决策的示例，左侧显示交易时间框架（3 分钟）的价格走势和设置， 右侧显示入市决策触发器。 
>
> 在下图 ，我们有一个相当激进的设置，即针对波段低点而不是更高时间框架（30  分钟）的 S/R，采取 BOF。 虽然概率较低，但当趋势明显减弱时，或者在这种情况下，涉及对高潮低点（或高点）的 较弱回测时，我确实很喜欢这些设置
>
> 右侧较低时间框架（1 分钟）的价格走势显示，在低点形成了一个短期支撑区域，支撑区 域下方的弹簧迅速失效。
>
> 入场时机是突破弹簧，即 E1。 在这个例子中，通过较低的时间框架（1 分钟）进入触发器，而不是在 LWP 进入，为我 们额外赢得了 6 个点

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102348607.png)

## 19.7案例2

> 在下图，我们看到了较高时间框架（30 分钟）支撑位的 TST。较低时间框架（1  分钟）图表（RHS）上的入场点 E1 在确认双底价格形态的高位收盘牛烛收盘时触发。
>
> 请 注意，在这种情况下，您不能在突破双底低点之间的震荡高点（传统的双底入场位置）时 入场，因为这样做会导致入场超出 LWP。虽然在这种情况下这样做也行得通，但这样做 会降低交易的概率，同时也会降低潜在的 R:R 比率。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102349434.png)

## 19.8案例3

> 在下图，我们看到 BOF 设置提供了两种基于形态的入市选择。第一个在 E1，是 跌破蜡烛 B 的低点；这是一个基于蜡烛 A（有点像流星！！）和蜡烛 B（旋转顶部）的 蜡烛形态触发点。第二个是 E2（如果您不喜欢 E1），这是一个微型 123 顶（较低的高点 ），由蜡烛 A 的高点、蜡烛 C 的低点和蜡烛 D 的高点形成，然后跌破蜡烛 C 的低点并继 续下行。 根据左侧的交易时间框架（3 分钟）图表，第二个（E2）入市选择也正好在我们的 LWP  上。因此，在这种情况下，除了通过观察较低时间框架（1 分钟）的情绪变化可能对入市 更有信心外，E2 与在 LWP 入市相比没有任何优势

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102353969.png)

## 19.9案例4

> 下图显示了 BPB 设置--先前的支撑变为阻力。
>
> 较低的时间框架（1 分钟）提供了两个 进入 BPB 的绝佳机会，都会触发烛台形态。可在看跌吞没形态下方的 E1 或射击之星下方 的 E2 进入。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102357758.png)

## 19.10案例5

> 下图 4.72 显示了处于上升趋势中的 CPB，交易时间框架（3 分钟）图形成了一个漂亮的春 季形态。LWP 是春季蜡烛图的突破口，尽管（通常情况下）我们要到蜡烛图收盘时才知 道。交易决定往往来得很快！ 从较低的时间框架（1 分钟）来看，我们看到短期支撑区域（由第一个回调波段末端的波 段低点形成）被突破。进入点 E1 就在突破这些蜡烛线时，这实际上既是一个春季触发点 ，也是一个蜡烛形态触发点（蜻蜓十字星和早晨之星）。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102358578.png)

# 20.0RR

> 价格走势为我们提供了一个止损点--如果我们的交易想法是有效的，价格就不应该下跌的 区域。
>
> 价格走势也为我们提供了一个目标--订单流将反对我们交易的区域，这可能只是暂时性的暂 停价格，但也可能完全扭转价格。
>
> 大多数交易者都会找到一个入场触发点，然后将止损点设在近期价格波动 H/L 以外的位置 ，衡量风险，设定一个 2-3 倍于风险的目标，然后坐等止损点或目标被击中。
>
> 他们甚至不会检查市场结构或价格走势，以确定目标是否切实可行。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102256320.png)

> 为什么要把 3:1 的 R:R 目标放在 S/R 障碍之外，然后只希望价格突破这些障碍？这太愚蠢 了

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/image-20240710225653453.png)

> 我们先设定止损价和目标价，然后在此基础上应用我们所需的 R:R  比率，以确定最后 R:R 价格 (LRP)，超过此价格就不能进场。

![](https://raw.githubusercontent.com/fightingwithmee/ytc/main/img/202407102257167.png)

> 我的第一部分入市目标是 1:1 的 R:R 比率。因此，LRP 被定义为止损位置和第一目标 T1 （下一交易时间段的波动 H/L 或 S/R 区域）之间的一半距离。
>
> 你可能会说，1:1 是不够的。请记住，我的主动管理策略旨在确保我很少在止损点退出亏 损；如果前提有疑问，我的目标是在止损点之前划掉它们。如果管理有效，这将降低我的 实际 R:R 比率的风险。 此外，这只是第一部分。第二部分可以运行到更远的目标（或直到触及追踪止损点），目 的是最大限度地提高实际 R:R 比率的收益。

